<!DOCTYPE html>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2">
<meta name="theme-color" content="#222">
<meta name="generator" content="Hexo 5.4.0">
  <link rel="apple-touch-icon" sizes="180x180" href="/blog/images/apple-touch-icon-next.png">
  <link rel="icon" type="image/png" sizes="32x32" href="/blog/images/favicon-32x32-next.png">
  <link rel="icon" type="image/png" sizes="16x16" href="/blog/images/favicon-16x16-next.png">
  <link rel="mask-icon" href="/blog/images/logo.svg" color="#222">

<link rel="stylesheet" href="/blog/css/main.css">


<link rel="stylesheet" href="/blog/lib/font-awesome/css/all.min.css">
<script id="hexo-configurations">
    var NexT = window.NexT || {};
    var CONFIG = {"hostname":"blog.iflyresearch.com","root":"/blog/","scheme":"Mist","version":"7.8.0","exturl":false,"sidebar":{"position":"left","display":"post","padding":18,"offset":12,"onmobile":false},"copycode":{"enable":false,"show_result":false,"style":null},"back2top":{"enable":true,"sidebar":true,"scrollpercent":true},"bookmark":{"enable":false,"color":"#222","save":"auto"},"fancybox":false,"mediumzoom":false,"lazyload":false,"pangu":false,"comments":{"style":"tabs","active":null,"storage":true,"lazyload":false,"nav":null},"algolia":{"hits":{"per_page":10},"labels":{"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}},"localsearch":{"enable":true,"trigger":"auto","top_n_per_article":1,"unescape":false,"preload":false},"motion":{"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},"path":"search.xml"};
  </script>

  <meta name="description" content="文章作者:jqpeng原文链接: 图数据库查询语言 本文介绍图数据库支持的gremlin和Cypher查询语言。 初始化数据可使用gremlin api执行 gremlin apiPOST http:&#x2F;&#x2F;localhost:8080&#x2F;gremlin &amp;#123;&quot;gremlin&quot;:&quot;这里是语句&quot;,  &quot;bindings&quot;: &amp;#123;&amp;">
<meta property="og:type" content="article">
<meta property="og:title" content="图数据库查询语言">
<meta property="og:url" content="http://blog.iflyresearch.com/2020/11/17/jqpeng-%E5%9B%BE%E6%95%B0%E6%8D%AE%E5%BA%93%E6%9F%A5%E8%AF%A2%E8%AF%AD%E8%A8%80/index.html">
<meta property="og:site_name" content="JadePeng的技术笔记本">
<meta property="og:description" content="文章作者:jqpeng原文链接: 图数据库查询语言 本文介绍图数据库支持的gremlin和Cypher查询语言。 初始化数据可使用gremlin api执行 gremlin apiPOST http:&#x2F;&#x2F;localhost:8080&#x2F;gremlin &amp;#123;&quot;gremlin&quot;:&quot;这里是语句&quot;,  &quot;bindings&quot;: &amp;#123;&amp;">
<meta property="og:locale" content="zh_CN">
<meta property="og:image" content="https://gitee.com/jadepeng/pic/raw/master/pic/2020/11/17/1605595541783.png">
<meta property="article:published_time" content="2020-11-17T06:48:00.000Z">
<meta property="article:modified_time" content="2021-05-14T09:44:20.293Z">
<meta property="article:author" content="JadePeng">
<meta property="article:tag" content="jqpeng">
<meta property="article:tag" content="知识图谱">
<meta name="twitter:card" content="summary">
<meta name="twitter:image" content="https://gitee.com/jadepeng/pic/raw/master/pic/2020/11/17/1605595541783.png">

<link rel="canonical" href="http://blog.iflyresearch.com/2020/11/17/jqpeng-%E5%9B%BE%E6%95%B0%E6%8D%AE%E5%BA%93%E6%9F%A5%E8%AF%A2%E8%AF%AD%E8%A8%80/">


<script id="page-configurations">
  // https://hexo.io/docs/variables.html
  CONFIG.page = {
    sidebar: "",
    isHome : false,
    isPost : true,
    lang   : 'zh-CN'
  };
</script>

  <title>图数据库查询语言 | JadePeng的技术笔记本</title>
  






  <noscript>
  <style>
  .use-motion .brand,
  .use-motion .menu-item,
  .sidebar-inner,
  .use-motion .post-block,
  .use-motion .pagination,
  .use-motion .comments,
  .use-motion .post-header,
  .use-motion .post-body,
  .use-motion .collection-header { opacity: initial; }

  .use-motion .site-title,
  .use-motion .site-subtitle {
    opacity: initial;
    top: initial;
  }

  .use-motion .logo-line-before i { left: initial; }
  .use-motion .logo-line-after i { right: initial; }
  </style>
</noscript>

</head>

<body itemscope itemtype="http://schema.org/WebPage">
  <div class="container use-motion">
    <div class="headband"></div>

    <header class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-container">
  <div class="site-nav-toggle">
    <div class="toggle" aria-label="切换导航栏">
      <span class="toggle-line toggle-line-first"></span>
      <span class="toggle-line toggle-line-middle"></span>
      <span class="toggle-line toggle-line-last"></span>
    </div>
  </div>

  <div class="site-meta">

    <a href="/blog/" class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <h1 class="site-title">JadePeng的技术笔记本</h1>
      <span class="logo-line-after"><i></i></span>
    </a>
      <p class="site-subtitle" itemprop="description">爱学习爱分享</p>
  </div>

  <div class="site-nav-right">
    <div class="toggle popup-trigger">
        <i class="fa fa-search fa-fw fa-lg"></i>
    </div>
  </div>
</div>




<nav class="site-nav">
  <ul id="menu" class="main-menu menu">
        <li class="menu-item menu-item-home">

    <a href="/blog/" rel="section"><i class="fa fa-home fa-fw"></i>首页</a>

  </li>
        <li class="menu-item menu-item-博客">

    <a href="/blog/categories/%E5%8D%9A%E5%AE%A2/" rel="section"><i class="fa fa-th fa-fw"></i>博客</a>

  </li>
        <li class="menu-item menu-item-分类">

    <a href="/blog/categories/" rel="section"><i class="fa fa-th fa-fw"></i>分类</a>

  </li>
        <li class="menu-item menu-item-tags">

    <a href="/blog/tags/" rel="section"><i class="fa fa-tags fa-fw"></i>标签</a>

  </li>
        <li class="menu-item menu-item-archives">

    <a href="/blog/archives/" rel="section"><i class="fa fa-archive fa-fw"></i>归档</a>

  </li>
      <li class="menu-item menu-item-search">
        <a role="button" class="popup-trigger"><i class="fa fa-search fa-fw"></i>搜索
        </a>
      </li>
  </ul>
</nav>



  <div class="search-pop-overlay">
    <div class="popup search-popup">
        <div class="search-header">
  <span class="search-icon">
    <i class="fa fa-search"></i>
  </span>
  <div class="search-input-container">
    <input autocomplete="off" autocapitalize="off"
           placeholder="搜索..." spellcheck="false"
           type="search" class="search-input">
  </div>
  <span class="popup-btn-close">
    <i class="fa fa-times-circle"></i>
  </span>
</div>
<div id="search-result">
  <div id="no-result">
    <i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>
  </div>
</div>

    </div>
  </div>

</div>
    </header>

    
  <div class="reading-progress-bar"></div>


    <main class="main">
      <div class="main-inner">
        <div class="content-wrap">
          

          <div class="content post posts-expand">
            

    
  
  
  <article itemscope itemtype="http://schema.org/Article" class="post-block" lang="zh-CN">
    <link itemprop="mainEntityOfPage" href="http://blog.iflyresearch.com/2020/11/17/jqpeng-%E5%9B%BE%E6%95%B0%E6%8D%AE%E5%BA%93%E6%9F%A5%E8%AF%A2%E8%AF%AD%E8%A8%80/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="image" content="/blog/images/avatar.gif">
      <meta itemprop="name" content="JadePeng">
      <meta itemprop="description" content="JadePeng的技术笔记本">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="JadePeng的技术笔记本">
    </span>
      <header class="post-header">
        <h1 class="post-title" itemprop="name headline">
          图数据库查询语言
        </h1>

        <div class="post-meta">

         
            <span class="post-meta-item">
              <span class="post-meta-item-icon">
                <i class="far fa-calendar"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>

              <time title="创建时间：2020-11-17 14:48:00" itemprop="dateCreated datePublished" datetime="2020-11-17T14:48:00+08:00">2020-11-17</time>
            </span>
              <span class="post-meta-item">
                <span class="post-meta-item-icon">
                  <i class="far fa-calendar-check"></i>
                </span>
                <span class="post-meta-item-text">更新于</span>
                <time title="修改时间：2021-05-14 17:44:20" itemprop="dateModified" datetime="2021-05-14T17:44:20+08:00">2021-05-14</time>
              </span>
            <span class="post-meta-item">
              <span class="post-meta-item-icon">
                <i class="far fa-folder"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/blog/categories/%E5%8D%9A%E5%AE%A2/" itemprop="url" rel="index"><span itemprop="name">博客</span></a>
                </span>
                  ，
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/blog/categories/%E5%8D%9A%E5%AE%A2/jqpeng/" itemprop="url" rel="index"><span itemprop="name">jqpeng</span></a>
                </span>
            </span>

          
            <span class="post-meta-item" title="阅读次数" id="busuanzi_container_page_pv">
              <span class="post-meta-item-icon">
                <i class="fa fa-eye"></i>
              </span>
              <span class="post-meta-item-text">阅读次数：</span>
              <span id="busuanzi_value_page_pv"></span>
            </span><br>
            <span class="post-meta-item" title="本文字数">
              <span class="post-meta-item-icon">
                <i class="far fa-file-word"></i>
              </span>
                <span class="post-meta-item-text">本文字数：</span>
              <span>7.7k</span>
            </span>
            <span class="post-meta-item" title="阅读时长">
              <span class="post-meta-item-icon">
                <i class="far fa-clock"></i>
              </span>
                <span class="post-meta-item-text">阅读时长 &asymp;</span>
              <span>7 分钟</span>
            </span>

        </div>
      </header>

    
    
    
    <div class="post-body" itemprop="articleBody">

      
        <p>文章作者:jqpeng<br>原文链接: <a target="_blank" rel="noopener" href="https://www.cnblogs.com/xiaoqi/p/graph-query-lang.html">图数据库查询语言</a></p>
<p>本文介绍图数据库支持的gremlin和Cypher查询语言。</p>
<h2 id="初始化数据"><a href="#初始化数据" class="headerlink" title="初始化数据"></a>初始化数据</h2><p>可使用gremlin api执行</p>
<h2 id="gremlin-api"><a href="#gremlin-api" class="headerlink" title="gremlin api"></a>gremlin api</h2><p>POST <a target="_blank" rel="noopener" href="http://localhost:8080/gremlin">http://localhost:8080/gremlin</a></p>
<pre><code>&#123;&quot;gremlin&quot;:&quot;这里是语句&quot;,
 &quot;bindings&quot;: &#123;&#125;,
&quot;language&quot;: &quot;gremlin-groovy&quot;,
&quot;aliases&quot;: &#123;    &quot;graph&quot;: &quot;graphname&quot;,     &quot;g&quot;: &quot;__g_graphname&quot;&#125;
&#125;
</code></pre>
<h3 id="schema"><a href="#schema" class="headerlink" title="schema"></a>schema</h3><pre><code>schema = hugegraph.schema()

schema.propertyKey(&quot;name&quot;).asText().ifNotExist().create()
schema.propertyKey(&quot;age&quot;).asInt().ifNotExist().create()
schema.propertyKey(&quot;time&quot;).asInt().ifNotExist().create()
schema.propertyKey(&quot;reason&quot;).asText().ifNotExist().create()
schema.propertyKey(&quot;type&quot;).asText().ifNotExist().create()

schema.vertexLabel(&quot;character&quot;).properties(&quot;name&quot;, &quot;age&quot;, &quot;type&quot;).primaryKeys(&quot;name&quot;).nullableKeys(&quot;age&quot;).ifNotExist().create()
schema.vertexLabel(&quot;location&quot;).properties(&quot;name&quot;).primaryKeys(&quot;name&quot;).ifNotExist().create()

schema.edgeLabel(&quot;father&quot;).link(&quot;character&quot;, &quot;character&quot;).ifNotExist().create()
schema.edgeLabel(&quot;mother&quot;).link(&quot;character&quot;, &quot;character&quot;).ifNotExist().create()
schema.edgeLabel(&quot;battled&quot;).link(&quot;character&quot;, &quot;character&quot;).properties(&quot;time&quot;).ifNotExist().create()
schema.edgeLabel(&quot;lives&quot;).link(&quot;character&quot;, &quot;location&quot;).properties(&quot;reason&quot;).nullableKeys(&quot;reason&quot;).ifNotExist().create()
schema.edgeLabel(&quot;pet&quot;).link(&quot;character&quot;, &quot;character&quot;).ifNotExist().create()
schema.edgeLabel(&quot;brother&quot;).link(&quot;character&quot;, &quot;character&quot;).ifNotExist().create()
</code></pre>
<h3 id="插入数据"><a href="#插入数据" class="headerlink" title="插入数据"></a>插入数据</h3><pre><code>// add vertices
Vertex saturn = graph.addVertex(T.label, &quot;character&quot;, &quot;name&quot;, &quot;saturn&quot;, &quot;age&quot;, 10000, &quot;type&quot;, &quot;titan&quot;)
Vertex sky = graph.addVertex(T.label, &quot;location&quot;, &quot;name&quot;, &quot;sky&quot;)
Vertex sea = graph.addVertex(T.label, &quot;location&quot;, &quot;name&quot;, &quot;sea&quot;)
Vertex jupiter = graph.addVertex(T.label, &quot;character&quot;, &quot;name&quot;, &quot;jupiter&quot;, &quot;age&quot;, 5000, &quot;type&quot;, &quot;god&quot;)
Vertex neptune = graph.addVertex(T.label, &quot;character&quot;, &quot;name&quot;, &quot;neptune&quot;, &quot;age&quot;, 4500, &quot;type&quot;, &quot;god&quot;)
Vertex hercules = graph.addVertex(T.label, &quot;character&quot;, &quot;name&quot;, &quot;hercules&quot;, &quot;age&quot;, 30, &quot;type&quot;, &quot;demigod&quot;)
Vertex alcmene = graph.addVertex(T.label, &quot;character&quot;, &quot;name&quot;, &quot;alcmene&quot;, &quot;age&quot;, 45, &quot;type&quot;, &quot;human&quot;)
Vertex pluto = graph.addVertex(T.label, &quot;character&quot;, &quot;name&quot;, &quot;pluto&quot;, &quot;age&quot;, 4000, &quot;type&quot;, &quot;god&quot;)
Vertex nemean = graph.addVertex(T.label, &quot;character&quot;, &quot;name&quot;, &quot;nemean&quot;, &quot;type&quot;, &quot;monster&quot;)
Vertex hydra = graph.addVertex(T.label, &quot;character&quot;, &quot;name&quot;, &quot;hydra&quot;, &quot;type&quot;, &quot;monster&quot;)
Vertex cerberus = graph.addVertex(T.label, &quot;character&quot;, &quot;name&quot;, &quot;cerberus&quot;, &quot;type&quot;, &quot;monster&quot;)
Vertex tartarus = graph.addVertex(T.label, &quot;location&quot;, &quot;name&quot;, &quot;tartarus&quot;)

// add edges
jupiter.addEdge(&quot;father&quot;, saturn)
jupiter.addEdge(&quot;lives&quot;, sky, &quot;reason&quot;, &quot;loves fresh breezes&quot;)
jupiter.addEdge(&quot;brother&quot;, neptune)
jupiter.addEdge(&quot;brother&quot;, pluto)
neptune.addEdge(&quot;lives&quot;, sea, &quot;reason&quot;, &quot;loves waves&quot;)
neptune.addEdge(&quot;brother&quot;, jupiter)
neptune.addEdge(&quot;brother&quot;, pluto)
hercules.addEdge(&quot;father&quot;, jupiter)
hercules.addEdge(&quot;mother&quot;, alcmene)
hercules.addEdge(&quot;battled&quot;, nemean, &quot;time&quot;, 1)
hercules.addEdge(&quot;battled&quot;, hydra, &quot;time&quot;, 2)
hercules.addEdge(&quot;battled&quot;, cerberus, &quot;time&quot;, 12)
pluto.addEdge(&quot;brother&quot;, jupiter)
pluto.addEdge(&quot;brother&quot;, neptune)
pluto.addEdge(&quot;lives&quot;, tartarus, &quot;reason&quot;, &quot;no fear of death&quot;)
pluto.addEdge(&quot;pet&quot;, cerberus)
cerberus.addEdge(&quot;lives&quot;, tartarus)
</code></pre>
<p><img src="https://gitee.com/jadepeng/pic/raw/master/pic/2020/11/17/1605595541783.png" alt="可视化"></p>
<h2 id="创建索引"><a href="#创建索引" class="headerlink" title="创建索引"></a>创建索引</h2><p>创建索引，使用REST API：</p>
<p>POST <a target="_blank" rel="noopener" href="http://localhost:8080/graphs/hugegraph/schema/indexlabels">http://localhost:8080/graphs/hugegraph/schema/indexlabels</a></p>
<pre><code>&#123;&quot;name&quot;: &quot;characterAge&quot;,&quot;base_type&quot;: &quot;VERTEX_LABEL&quot;,&quot;base_value&quot;: &quot;character&quot;,&quot;index_type&quot;: &quot;RANGE&quot;,&quot;fields&quot;: [    &quot;age&quot;]
&#125;
</code></pre>
<h2 id="查询"><a href="#查询" class="headerlink" title="查询"></a>查询</h2><h3 id="API-说明"><a href="#API-说明" class="headerlink" title="API 说明"></a>API 说明</h3><p>支持<code>gremlin</code>、<code>sparql</code>和<code>Cypher</code> api，推荐gremlin和Cypher</p>
<h4 id="cypher-api"><a href="#cypher-api" class="headerlink" title="cypher api"></a>cypher api</h4><pre><code>http://127.0.0.1:8080/graphs/hugegraph/cypher?cypher=
</code></pre>
<p>eg:</p>
<pre><code>curl http://127.0.0.1:8080/graphs/hugegraph/cypher?cypher=MATCH%20(n:character)-[:lives]-%3E(location)-[:lives]-(cohabitants)%20where%20n.name=%27pluto%27%20return%20cohabitants.name
</code></pre>
<h4 id="gremlin-api-1"><a href="#gremlin-api-1" class="headerlink" title="gremlin api"></a>gremlin api</h4><p>POST <a target="_blank" rel="noopener" href="http://localhost:8080/gremlin">http://localhost:8080/gremlin</a></p>
<pre><code>&#123;&quot;gremlin&quot;:&quot;这里是语句&quot;,
 &quot;bindings&quot;: &#123;&#125;,
&quot;language&quot;: &quot;gremlin-groovy&quot;,
&quot;aliases&quot;: &#123;    &quot;graph&quot;: &quot;graphname&quot;,     &quot;g&quot;: &quot;__g_graphname&quot;&#125;
&#125;
</code></pre>
<h4 id="sparql-api"><a href="#sparql-api" class="headerlink" title="sparql api"></a>sparql api</h4><pre><code>GET http://127.0.0.1:8080/graphs/hugegraph/sparql?sparql=SELECT%20*%20WHERE%20&#123;%20&#125;
</code></pre>
<p><strong>1. 查询hercules的祖父</strong></p>
<pre><code>g.V().hasLabel(&#39;character&#39;).has(&#39;name&#39;,&#39;hercules&#39;).out(&#39;father&#39;).out(&#39;father&#39;)
</code></pre>
<p>也可以通过<code>repeat</code>方式：</p>
<pre><code>g.V().hasLabel(&#39;character&#39;).has(&#39;name&#39;,&#39;hercules&#39;).repeat(__.out(&#39;father&#39;)).times(2)
</code></pre>
<p><strong>cypher</strong></p>
<pre><code>MATCH (n:character)-[:father]-&gt;()-[:father]-&gt;(grandfather) where n.name=&#39;hercules&#39; return grandfather
</code></pre>
<p><strong>2. Find the name of hercules’s father</strong></p>
<pre><code>g.V().hasLabel(&#39;character&#39;).has(&#39;name&#39;,&#39;hercules&#39;).out(&#39;father&#39;).value(&#39;name&#39;)
</code></pre>
<p><strong>cypher</strong></p>
<pre><code>MATCH (n:character)-[:father]-&gt;(father) where n.name=&#39;hercules&#39; return father.name
</code></pre>
<p><strong>3. Find the characters with age &gt; 100</strong></p>
<pre><code>g.V().hasLabel(&#39;character&#39;).has(&#39;age&#39;,gt(100))
</code></pre>
<p><strong>cypher</strong></p>
<pre><code>MATCH (n:character) where n.age &gt; 10 return n
</code></pre>
<p><strong>4. Find who are pluto’s cohabitants</strong></p>
<pre><code>g.V().hasLabel(&#39;character&#39;).has(&#39;name&#39;,&#39;pluto&#39;).out(&#39;lives&#39;).in(&#39;lives&#39;).values(&#39;name&#39;)
</code></pre>
<p><strong>cypher</strong></p>
<pre><code>MATCH (n:character)-[:lives]-&gt;(location)-[:lives]-(cohabitants) where n.name=&#39;pluto&#39; return cohabitants.name
</code></pre>
<p><strong>5. Find pluto can’t be his own cohabitant</strong></p>
<pre><code>pluto = g.V().hasLabel(&#39;character&#39;).has(&#39;name&#39;, &#39;pluto&#39;)
g.V(pluto).out(&#39;lives&#39;).in(&#39;lives&#39;).where(is(neq(pluto)).values(&#39;name&#39;)

// use &#39;as&#39;
g.V().hasLabel(&#39;character&#39;).has(&#39;name&#39;, &#39;pluto&#39;).as(&#39;x&#39;).out(&#39;lives&#39;).in(&#39;lives&#39;).where(neq(&#39;x&#39;)).values(&#39;name&#39;)




cypher&gt; MATCH (src:character&#123;name:&quot;pluto&quot;&#125;)-[:lives]-&gt;()&lt;-[:lives]-(dst:character) RETURN dst.name
</code></pre>
<p><strong>6. Pluto’s Brothers</strong></p>
<pre><code>pluto = g.V().hasLabel(&#39;character&#39;).has(&#39;name&#39;, &#39;pluto&#39;).next()
// where do pluto&#39;s brothers live?
g.V(pluto).out(&#39;brother&#39;).out(&#39;lives&#39;).values(&#39;name&#39;)

// which brother lives in which place?
g.V(pluto).out(&#39;brother&#39;).as(&#39;god&#39;).out(&#39;lives&#39;).as(&#39;place&#39;).select(&#39;god&#39;,&#39;place&#39;)

// what is the name of the brother and the name of the place?
g.V(pluto).out(&#39;brother&#39;).as(&#39;god&#39;).out(&#39;lives&#39;).as(&#39;place&#39;).select(&#39;god&#39;,&#39;place&#39;).by(&#39;name&#39;)



MATCH (src:Character&#123;name:&quot;pluto&quot;&#125;)-[:brother]-&gt;(bro:Character)-[:lives]-&gt;(dst)
RETURN bro.name, dst.name
</code></pre>
<hr>
<blockquote>
<p>作者：Jadepeng<br> 出处：jqpeng的技术记事本–<a target="_blank" rel="noopener" href="http://www.cnblogs.com/xiaoqi">http://www.cnblogs.com/xiaoqi</a><br> 您的支持是对博主最大的鼓励，感谢您的认真阅读。<br> 本文版权归作者所有，欢迎转载，但未经作者同意必须保留此段声明，且在文章页面明显位置给出原文连接，否则保留追究法律责任的权利。</p>
</blockquote>

    </div>

    
    
    

      <footer class="post-footer">
          <div class="post-tags">
              <a href="/blog/tags/jqpeng/" rel="tag"># jqpeng</a>
              <a href="/blog/tags/%E7%9F%A5%E8%AF%86%E5%9B%BE%E8%B0%B1/" rel="tag"># 知识图谱</a>
          </div>
        


        
    <div class="post-nav">
      <div class="post-nav-item">
    <a href="/blog/2020/11/04/jqpeng-axios%20%E6%B5%8F%E8%A7%88%E5%99%A8%E5%86%85%E5%AD%98%E6%B3%84%E9%9C%B2%E9%97%AE%E9%A2%98%E8%A7%A3%E5%86%B3/" rel="prev" title="axios 浏览器内存泄露问题解决">
      <i class="fa fa-chevron-left"></i> axios 浏览器内存泄露问题解决
    </a></div>
      <div class="post-nav-item">
    <a href="/blog/2020/11/17/jqpeng-hugegraph%20%E6%94%AF%E6%8C%81sparql%20%E4%B8%8Ecypher/" rel="next" title="hugegraph 支持sparql 与cypher">
      hugegraph 支持sparql 与cypher <i class="fa fa-chevron-right"></i>
    </a></div>
    </div>
      </footer>
    
  </article>
  
  
  



          </div>
          

<script>
  window.addEventListener('tabs:register', () => {
    let { activeClass } = CONFIG.comments;
    if (CONFIG.comments.storage) {
      activeClass = localStorage.getItem('comments_active') || activeClass;
    }
    if (activeClass) {
      let activeTab = document.querySelector(`a[href="#comment-${activeClass}"]`);
      if (activeTab) {
        activeTab.click();
      }
    }
  });
  if (CONFIG.comments.storage) {
    window.addEventListener('tabs:click', event => {
      if (!event.target.matches('.tabs-comment .tab-content .tab-pane')) return;
      let commentClass = event.target.classList[1];
      localStorage.setItem('comments_active', commentClass);
    });
  }
</script>

        </div>
          
  
  <div class="toggle sidebar-toggle">
    <span class="toggle-line toggle-line-first"></span>
    <span class="toggle-line toggle-line-middle"></span>
    <span class="toggle-line toggle-line-last"></span>
  </div>

  <aside class="sidebar">
    <div class="sidebar-inner">

      <ul class="sidebar-nav motion-element">
        <li class="sidebar-nav-toc">
          文章目录
        </li>
        <li class="sidebar-nav-overview">
          站点概览
        </li>
      </ul>

      <!--noindex-->
      <div class="post-toc-wrap sidebar-panel">
          <div class="post-toc motion-element"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#%E5%88%9D%E5%A7%8B%E5%8C%96%E6%95%B0%E6%8D%AE"><span class="nav-number">1.</span> <span class="nav-text">初始化数据</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#gremlin-api"><span class="nav-number">2.</span> <span class="nav-text">gremlin api</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#schema"><span class="nav-number">2.1.</span> <span class="nav-text">schema</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#%E6%8F%92%E5%85%A5%E6%95%B0%E6%8D%AE"><span class="nav-number">2.2.</span> <span class="nav-text">插入数据</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#%E5%88%9B%E5%BB%BA%E7%B4%A2%E5%BC%95"><span class="nav-number">3.</span> <span class="nav-text">创建索引</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#%E6%9F%A5%E8%AF%A2"><span class="nav-number">4.</span> <span class="nav-text">查询</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#API-%E8%AF%B4%E6%98%8E"><span class="nav-number">4.1.</span> <span class="nav-text">API 说明</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#cypher-api"><span class="nav-number">4.1.1.</span> <span class="nav-text">cypher api</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#gremlin-api-1"><span class="nav-number">4.1.2.</span> <span class="nav-text">gremlin api</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#sparql-api"><span class="nav-number">4.1.3.</span> <span class="nav-text">sparql api</span></a></li></ol></li></ol></li></ol></div>
      </div>
      <!--/noindex-->

      <div class="site-overview-wrap sidebar-panel">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <img class="site-author-image" itemprop="image" alt="JadePeng"
      src="/blog/images/avatar.gif">
  <p class="site-author-name" itemprop="name">JadePeng</p>
  <div class="site-description" itemprop="description">JadePeng的技术笔记本</div>
</div>
<div class="site-state-wrap motion-element">
  <nav class="site-state">
      <div class="site-state-item site-state-posts">
          <a href="/blog/archives/">
        
          <span class="site-state-item-count">100</span>
          <span class="site-state-item-name">日志</span>
        </a>
      </div>
      <div class="site-state-item site-state-categories">
            <a href="/blog/categories/">
        <span class="site-state-item-count">3</span>
        <span class="site-state-item-name">分类</span></a>
      </div>
      <div class="site-state-item site-state-tags">
            <a href="/blog/tags/">
          
        <span class="site-state-item-count">87</span>
        <span class="site-state-item-name">标签</span></a>
      </div>
  </nav>
</div>



      </div>
        <div class="back-to-top motion-element">
          <i class="fa fa-arrow-up"></i>
          <span>0%</span>
        </div>

    </div>
  </aside>
  <div id="sidebar-dimmer"></div>


      </div>
    </main>

    <footer class="footer">
      <div class="footer-inner">
        

        

<div class="copyright">
  
  &copy; 
  <span itemprop="copyrightYear">2021</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">JadePeng</span>
    <span class="post-meta-divider">|</span>
    <span class="post-meta-item-icon">
      <i class="fa fa-chart-area"></i>
    </span>
      <span class="post-meta-item-text">站点总字数：</span>
    <span title="站点总字数">644k</span>
    <span class="post-meta-divider">|</span>
    <span class="post-meta-item-icon">
      <i class="fa fa-coffee"></i>
    </span>
      <span class="post-meta-item-text">站点阅读时长 &asymp;</span>
    <span title="站点阅读时长">9:46</span>
</div>
  <div class="powered-by">由 <a href="https://hexo.io/" class="theme-link" rel="noopener" target="_blank">Hexo</a> & <a href="https://mist.theme-next.org/" class="theme-link" rel="noopener" target="_blank">NexT.Mist</a> 强力驱动
  </div>

        
<div class="busuanzi-count">
  <script async src="https://busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
    <span class="post-meta-item" id="busuanzi_container_site_uv">
      <span class="post-meta-item-icon">
        <i class="fa fa-user"></i>
      </span>
      <span class="site-uv" title="总访客量">
        <span id="busuanzi_value_site_uv"></span>
      </span>
    </span>
    <span class="post-meta-divider">|</span>
    <span class="post-meta-item" id="busuanzi_container_site_pv">
      <span class="post-meta-item-icon">
        <i class="fa fa-eye"></i>
      </span>
      <span class="site-pv" title="总访问量">
        <span id="busuanzi_value_site_pv"></span>
      </span>
    </span>
</div>








      </div>
    </footer>
  </div>

  
  <script src="/blog/lib/anime.min.js"></script>
  <script src="/blog/lib/velocity/velocity.min.js"></script>
  <script src="/blog/lib/velocity/velocity.ui.min.js"></script>

<script src="/blog/js/utils.js"></script>

<script src="/blog/js/motion.js"></script>


<script src="/blog/js/schemes/muse.js"></script>


<script src="/blog/js/next-boot.js"></script>




  




  
<script src="/blog/js/local-search.js"></script>









<script>
document.querySelectorAll('.pdfobject-container').forEach(element => {
  let url = element.dataset.target;
  let pdfOpenParams = {
    navpanes : 0,
    toolbar  : 0,
    statusbar: 0,
    pagemode : 'thumbs',
    view     : 'FitH'
  };
  let pdfOpenFragment = '#' + Object.entries(pdfOpenParams).map(([key, value]) => `${key}=${encodeURIComponent(value)}`).join('&');
  let fullURL = `/blog/lib/pdf/web/viewer.html?file=${encodeURIComponent(url)}${pdfOpenFragment}`;

  if (NexT.utils.supportsPDFs()) {
    element.innerHTML = `<embed class="pdfobject" src="${url + pdfOpenFragment}" type="application/pdf" style="height: ${element.dataset.height};">`;
  } else {
    element.innerHTML = `<iframe src="${fullURL}" style="height: ${element.dataset.height};" frameborder="0"></iframe>`;
  }
});
</script>


<script>
if (document.querySelectorAll('pre.mermaid').length) {
  NexT.utils.getScript('//cdn.jsdelivr.net/npm/mermaid@8/dist/mermaid.min.js', () => {
    mermaid.initialize({
      theme    : 'forest',
      logLevel : 3,
      flowchart: { curve     : 'linear' },
      gantt    : { axisFormat: '%m/%d/%Y' },
      sequence : { actorMargin: 50 }
    });
  }, window.mermaid);
}
</script>


  

  

</body>
</html>
