<!DOCTYPE html>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2">
<meta name="theme-color" content="#222">
<meta name="generator" content="Hexo 5.4.0">
  <link rel="apple-touch-icon" sizes="180x180" href="/jadepeng/images/apple-touch-icon-next.png">
  <link rel="icon" type="image/png" sizes="32x32" href="/jadepeng/images/favicon-32x32-next.png">
  <link rel="icon" type="image/png" sizes="16x16" href="/jadepeng/images/favicon-16x16-next.png">
  <link rel="mask-icon" href="/jadepeng/images/logo.svg" color="#222">

<link rel="stylesheet" href="/jadepeng/css/main.css">


<link rel="stylesheet" href="/jadepeng/lib/font-awesome/css/all.min.css">
<script id="hexo-configurations">
    var NexT = window.NexT || {};
    var CONFIG = {"hostname":"blog.iflyresearch.com","root":"/jadepeng/","scheme":"Mist","version":"7.8.0","exturl":false,"sidebar":{"position":"left","display":"post","padding":18,"offset":12,"onmobile":false},"copycode":{"enable":false,"show_result":false,"style":null},"back2top":{"enable":true,"sidebar":true,"scrollpercent":true},"bookmark":{"enable":false,"color":"#222","save":"auto"},"fancybox":false,"mediumzoom":false,"lazyload":false,"pangu":false,"comments":{"style":"tabs","active":null,"storage":true,"lazyload":false,"nav":null},"algolia":{"hits":{"per_page":10},"labels":{"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}},"localsearch":{"enable":true,"trigger":"auto","top_n_per_article":1,"unescape":false,"preload":false},"motion":{"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},"path":"search.xml"};
  </script>

  <meta name="description" content="JadePeng的技术笔记本">
<meta property="og:type" content="website">
<meta property="og:title" content="JadePeng的技术笔记本">
<meta property="og:url" content="http://blog.iflyresearch.com/page/2/index.html">
<meta property="og:site_name" content="JadePeng的技术笔记本">
<meta property="og:description" content="JadePeng的技术笔记本">
<meta property="og:locale" content="zh_CN">
<meta property="article:author" content="JadePeng">
<meta name="twitter:card" content="summary">

<link rel="canonical" href="http://blog.iflyresearch.com/page/2/">


<script id="page-configurations">
  // https://hexo.io/docs/variables.html
  CONFIG.page = {
    sidebar: "",
    isHome : true,
    isPost : false,
    lang   : 'zh-CN'
  };
</script>

  <title>JadePeng的技术笔记本</title>
  






  <noscript>
  <style>
  .use-motion .brand,
  .use-motion .menu-item,
  .sidebar-inner,
  .use-motion .post-block,
  .use-motion .pagination,
  .use-motion .comments,
  .use-motion .post-header,
  .use-motion .post-body,
  .use-motion .collection-header { opacity: initial; }

  .use-motion .site-title,
  .use-motion .site-subtitle {
    opacity: initial;
    top: initial;
  }

  .use-motion .logo-line-before i { left: initial; }
  .use-motion .logo-line-after i { right: initial; }
  </style>
</noscript>

</head>

<body itemscope itemtype="http://schema.org/WebPage">
  <div class="container use-motion">
    <div class="headband"></div>

    <header class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-container">
  <div class="site-nav-toggle">
    <div class="toggle" aria-label="切换导航栏">
      <span class="toggle-line toggle-line-first"></span>
      <span class="toggle-line toggle-line-middle"></span>
      <span class="toggle-line toggle-line-last"></span>
    </div>
  </div>

  <div class="site-meta">

    <a href="/jadepeng/" class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <h1 class="site-title">JadePeng的技术笔记本</h1>
      <span class="logo-line-after"><i></i></span>
    </a>
      <p class="site-subtitle" itemprop="description">爱学习爱分享</p>
  </div>

  <div class="site-nav-right">
    <div class="toggle popup-trigger">
        <i class="fa fa-search fa-fw fa-lg"></i>
    </div>
  </div>
</div>




<nav class="site-nav">
  <ul id="menu" class="main-menu menu">
        <li class="menu-item menu-item-home">

    <a href="/jadepeng/" rel="section"><i class="fa fa-home fa-fw"></i>首页</a>

  </li>
        <li class="menu-item menu-item-博客">

    <a href="/jadepeng/categories/%E5%8D%9A%E5%AE%A2/" rel="section"><i class="fa fa-th fa-fw"></i>博客</a>

  </li>
        <li class="menu-item menu-item-分类">

    <a href="/jadepeng/categories/" rel="section"><i class="fa fa-th fa-fw"></i>分类</a>

  </li>
        <li class="menu-item menu-item-tags">

    <a href="/jadepeng/tags/" rel="section"><i class="fa fa-tags fa-fw"></i>标签</a>

  </li>
        <li class="menu-item menu-item-archives">

    <a href="/jadepeng/archives/" rel="section"><i class="fa fa-archive fa-fw"></i>归档</a>

  </li>
      <li class="menu-item menu-item-search">
        <a role="button" class="popup-trigger"><i class="fa fa-search fa-fw"></i>搜索
        </a>
      </li>
  </ul>
</nav>



  <div class="search-pop-overlay">
    <div class="popup search-popup">
        <div class="search-header">
  <span class="search-icon">
    <i class="fa fa-search"></i>
  </span>
  <div class="search-input-container">
    <input autocomplete="off" autocapitalize="off"
           placeholder="搜索..." spellcheck="false"
           type="search" class="search-input">
  </div>
  <span class="popup-btn-close">
    <i class="fa fa-times-circle"></i>
  </span>
</div>
<div id="search-result">
  <div id="no-result">
    <i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>
  </div>
</div>

    </div>
  </div>

</div>
    </header>

    
  <div class="reading-progress-bar"></div>


    <main class="main">
      <div class="main-inner">
        <div class="content-wrap">
          

          <div class="content index posts-expand">
            
      
  
  
  <article itemscope itemtype="http://schema.org/Article" class="post-block" lang="zh-CN">
    <link itemprop="mainEntityOfPage" href="http://blog.iflyresearch.com/2020/11/18/jqpeng-spring%20boot%E5%AE%9E%E7%8E%B0%E8%B6%85%E8%BD%BB%E9%87%8F%E7%BA%A7%E7%BD%91%E5%85%B3%EF%BC%88%E5%8F%8D%E5%90%91%E4%BB%A3%E7%90%86%E3%80%81%E8%BD%AC%E5%8F%91%EF%BC%89/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="image" content="/jadepeng/images/avatar.gif">
      <meta itemprop="name" content="JadePeng">
      <meta itemprop="description" content="JadePeng的技术笔记本">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="JadePeng的技术笔记本">
    </span>
      <header class="post-header">
        <h2 class="post-title" itemprop="name headline">
          
            <a href="/jadepeng/2020/11/18/jqpeng-spring%20boot%E5%AE%9E%E7%8E%B0%E8%B6%85%E8%BD%BB%E9%87%8F%E7%BA%A7%E7%BD%91%E5%85%B3%EF%BC%88%E5%8F%8D%E5%90%91%E4%BB%A3%E7%90%86%E3%80%81%E8%BD%AC%E5%8F%91%EF%BC%89/" class="post-title-link" itemprop="url">spring boot实现超轻量级网关（反向代理、转发）</a>
        </h2>

        <div class="post-meta">

         
            <span class="post-meta-item">
              <span class="post-meta-item-icon">
                <i class="far fa-calendar"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>

              <time title="创建时间：2020-11-18 10:11:00" itemprop="dateCreated datePublished" datetime="2020-11-18T10:11:00+08:00">2020-11-18</time>
            </span>
              <span class="post-meta-item">
                <span class="post-meta-item-icon">
                  <i class="far fa-calendar-check"></i>
                </span>
                <span class="post-meta-item-text">更新于</span>
                <time title="修改时间：2021-07-12 21:28:27" itemprop="dateModified" datetime="2021-07-12T21:28:27+08:00">2021-07-12</time>
              </span>
            <span class="post-meta-item">
              <span class="post-meta-item-icon">
                <i class="far fa-folder"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/jadepeng/categories/%E5%8D%9A%E5%AE%A2/" itemprop="url" rel="index"><span itemprop="name">博客</span></a>
                </span>
                  ，
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/jadepeng/categories/%E5%8D%9A%E5%AE%A2/jqpeng/" itemprop="url" rel="index"><span itemprop="name">jqpeng</span></a>
                </span>
            </span>

          <br>
            <span class="post-meta-item" title="本文字数">
              <span class="post-meta-item-icon">
                <i class="far fa-file-word"></i>
              </span>
                <span class="post-meta-item-text">本文字数：</span>
              <span>5.1k</span>
            </span>
            <span class="post-meta-item" title="阅读时长">
              <span class="post-meta-item-icon">
                <i class="far fa-clock"></i>
              </span>
                <span class="post-meta-item-text">阅读时长 &asymp;</span>
              <span>5 分钟</span>
            </span>

        </div>
      </header>

    
    
    
    <div class="post-body" itemprop="articleBody">

      
          <p>文章作者:jqpeng<br>原文链接: <a target="_blank" rel="noopener" href="https://www.cnblogs.com/xiaoqi/p/spring-boot-route.html">spring boot实现超轻量级网关（反向代理、转发）</a></p>
<p>在我们的rest服务中，需要暴露一个中间件的接口给用户，但是需要经过rest服务的认证，这是典型的网关使用场景。可以引入网关组件来搞定，但是引入zuul等中间件会增加系统复杂性，这里实现一个超轻量级的网关，只实现请求转发，认证等由rest服务的spring security来搞定。</p>
<p>如何进行请求转发呢？ 熟悉网络请求的同学应该很清楚，请求无非就是请求方式、HTTP header，以及请求body，我们将这些信息取出来，透传给转发的url即可。</p>
<p>举例：</p>
<p>/graphdb/**   转发到 Graph_Server/**</p>
<h2 id="获取转发目的地址："><a href="#获取转发目的地址：" class="headerlink" title="获取转发目的地址："></a>获取转发目的地址：</h2><pre><code>private String createRedictUrl(HttpServletRequest request, String routeUrl, String prefix) &#123;
        String queryString = request.getQueryString();
        return routeUrl + request.getRequestURI().replace(prefix, &quot;&quot;) +
                (queryString != null ? &quot;?&quot; + queryString : &quot;&quot;);
    &#125;
</code></pre>
<h2 id="解析请求头和内容"><a href="#解析请求头和内容" class="headerlink" title="解析请求头和内容"></a>解析请求头和内容</h2><p>然后从request中提取出header、body等内容，构造一个<code>RequestEntity</code>，后续可以用<code>RestTemplate</code>来请求。</p>
<pre><code>private RequestEntity createRequestEntity(HttpServletRequest request, String url) throws URISyntaxException, IOException &#123;
        String method = request.getMethod();
        HttpMethod httpMethod = HttpMethod.resolve(method);
        MultiValueMap&lt;String, String&gt; headers = parseRequestHeader(request);
        byte[] body = parseRequestBody(request);
        return new RequestEntity&lt;&gt;(body, headers, httpMethod, new URI(url));
    &#125;


    private byte[] parseRequestBody(HttpServletRequest request) throws IOException &#123;
        InputStream inputStream = request.getInputStream();
        return StreamUtils.copyToByteArray(inputStream);
    &#125;

    private MultiValueMap&lt;String, String&gt; parseRequestHeader(HttpServletRequest request) &#123;
        HttpHeaders headers = new HttpHeaders();
        List&lt;String&gt; headerNames = Collections.list(request.getHeaderNames());
        for (String headerName : headerNames) &#123;
            List&lt;String&gt; headerValues = Collections.list(request.getHeaders(headerName));
            for (String headerValue : headerValues) &#123;
                headers.add(headerName, headerValue);
            &#125;
        &#125;
        return headers;
    &#125;
</code></pre>
<h2 id="透明转发"><a href="#透明转发" class="headerlink" title="透明转发"></a>透明转发</h2><p>最后用<code>RestTemplate</code>来实现请求：</p>
<pre><code> private ResponseEntity&lt;String&gt; route(RequestEntity requestEntity) &#123;
        RestTemplate restTemplate = new RestTemplate();
        return restTemplate.exchange(requestEntity, String.class);
    &#125;
</code></pre>
<h2 id="全部代码"><a href="#全部代码" class="headerlink" title="全部代码"></a>全部代码</h2><p>以下是轻量级转发全部代码：</p>
<pre><code>import org.springframework.http.*;
import org.springframework.stereotype.Service;
import org.springframework.util.MultiValueMap;
import org.springframework.util.StreamUtils;
import org.springframework.web.client.RestTemplate;

import javax.servlet.http.HttpServletRequest;
import javax.servlet.http.HttpServletResponse;
import java.io.IOException;
import java.io.InputStream;
import java.net.URI;
import java.net.URISyntaxException;
import java.util.Collections;
import java.util.List;

@Service
public class RoutingDelegate &#123;


    public ResponseEntity&lt;String&gt; redirect(HttpServletRequest request, HttpServletResponse response,String routeUrl, String prefix) &#123;
        try &#123;
            // build up the redirect URL
            String redirectUrl = createRedictUrl(request,routeUrl, prefix);
            RequestEntity requestEntity = createRequestEntity(request, redirectUrl);
            return route(requestEntity);
        &#125; catch (Exception e) &#123;
            return new ResponseEntity(&quot;REDIRECT ERROR&quot;, HttpStatus.INTERNAL_SERVER_ERROR);
        &#125;
    &#125;

    private String createRedictUrl(HttpServletRequest request, String routeUrl, String prefix) &#123;
        String queryString = request.getQueryString();
        return routeUrl + request.getRequestURI().replace(prefix, &quot;&quot;) +
                (queryString != null ? &quot;?&quot; + queryString : &quot;&quot;);
    &#125;


    private RequestEntity createRequestEntity(HttpServletRequest request, String url) throws URISyntaxException, IOException &#123;
        String method = request.getMethod();
        HttpMethod httpMethod = HttpMethod.resolve(method);
        MultiValueMap&lt;String, String&gt; headers = parseRequestHeader(request);
        byte[] body = parseRequestBody(request);
        return new RequestEntity&lt;&gt;(body, headers, httpMethod, new URI(url));
    &#125;
    private ResponseEntity&lt;String&gt; route(RequestEntity requestEntity) &#123;
        RestTemplate restTemplate = new RestTemplate();
        return restTemplate.exchange(requestEntity, String.class);
    &#125;


    private byte[] parseRequestBody(HttpServletRequest request) throws IOException &#123;
        InputStream inputStream = request.getInputStream();
        return StreamUtils.copyToByteArray(inputStream);
    &#125;

    private MultiValueMap&lt;String, String&gt; parseRequestHeader(HttpServletRequest request) &#123;
        HttpHeaders headers = new HttpHeaders();
        List&lt;String&gt; headerNames = Collections.list(request.getHeaderNames());
        for (String headerName : headerNames) &#123;
            List&lt;String&gt; headerValues = Collections.list(request.getHeaders(headerName));
            for (String headerValue : headerValues) &#123;
                headers.add(headerName, headerValue);
            &#125;
        &#125;
        return headers;
    &#125;
&#125;
</code></pre>
<h2 id="Spring-集成"><a href="#Spring-集成" class="headerlink" title="Spring 集成"></a>Spring 集成</h2><p>Spring Controller,RequestMapping里把GET \ POST\PUT\DELETE 支持的请求带上，就能实现转发了。</p>
<pre><code>@RestController
@RequestMapping(GraphDBController.DELEGATE_PREFIX)
@Api(value = &quot;GraphDB&quot;, tags = &#123;
        &quot;graphdb-Api&quot;
&#125;)
public class GraphDBController &#123;

    @Autowired
    GraphProperties graphProperties;

    public final static String DELEGATE_PREFIX = &quot;/graphdb&quot;;

    @Autowired
    private RoutingDelegate routingDelegate;

    @RequestMapping(value = &quot;/**&quot;, method = &#123;RequestMethod.GET, RequestMethod.POST, RequestMethod.PUT, RequestMethod.DELETE&#125;, produces = MediaType.TEXT_PLAIN_VALUE)
    public ResponseEntity catchAll(HttpServletRequest request, HttpServletResponse response) &#123;
        return routingDelegate.redirect(request, response, graphProperties.getGraphServer(), DELEGATE_PREFIX);
    &#125;
&#125;
</code></pre>
<hr>
<blockquote>
<p>作者：Jadepeng<br> 出处：jqpeng的技术记事本–<a target="_blank" rel="noopener" href="http://www.cnblogs.com/xiaoqi">http://www.cnblogs.com/xiaoqi</a><br> 您的支持是对博主最大的鼓励，感谢您的认真阅读。<br> 本文版权归作者所有，欢迎转载，但未经作者同意必须保留此段声明，且在文章页面明显位置给出原文连接，否则保留追究法律责任的权利。</p>
</blockquote>

      
    </div>

    
    
    
      <footer class="post-footer">
        <div class="post-eof"></div>
      </footer>
  </article>
  
  
  

      
  
  
  <article itemscope itemtype="http://schema.org/Article" class="post-block" lang="zh-CN">
    <link itemprop="mainEntityOfPage" href="http://blog.iflyresearch.com/2020/11/17/jqpeng-hugegraph%20%E6%94%AF%E6%8C%81sparql%20%E4%B8%8Ecypher/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="image" content="/jadepeng/images/avatar.gif">
      <meta itemprop="name" content="JadePeng">
      <meta itemprop="description" content="JadePeng的技术笔记本">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="JadePeng的技术笔记本">
    </span>
      <header class="post-header">
        <h2 class="post-title" itemprop="name headline">
          
            <a href="/jadepeng/2020/11/17/jqpeng-hugegraph%20%E6%94%AF%E6%8C%81sparql%20%E4%B8%8Ecypher/" class="post-title-link" itemprop="url">hugegraph 支持sparql 与cypher</a>
        </h2>

        <div class="post-meta">

         
            <span class="post-meta-item">
              <span class="post-meta-item-icon">
                <i class="far fa-calendar"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>

              <time title="创建时间：2020-11-17 15:10:00" itemprop="dateCreated datePublished" datetime="2020-11-17T15:10:00+08:00">2020-11-17</time>
            </span>
              <span class="post-meta-item">
                <span class="post-meta-item-icon">
                  <i class="far fa-calendar-check"></i>
                </span>
                <span class="post-meta-item-text">更新于</span>
                <time title="修改时间：2021-07-12 21:28:27" itemprop="dateModified" datetime="2021-07-12T21:28:27+08:00">2021-07-12</time>
              </span>
            <span class="post-meta-item">
              <span class="post-meta-item-icon">
                <i class="far fa-folder"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/jadepeng/categories/%E5%8D%9A%E5%AE%A2/" itemprop="url" rel="index"><span itemprop="name">博客</span></a>
                </span>
                  ，
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/jadepeng/categories/%E5%8D%9A%E5%AE%A2/jqpeng/" itemprop="url" rel="index"><span itemprop="name">jqpeng</span></a>
                </span>
            </span>

          <br>
            <span class="post-meta-item" title="本文字数">
              <span class="post-meta-item-icon">
                <i class="far fa-file-word"></i>
              </span>
                <span class="post-meta-item-text">本文字数：</span>
              <span>2.8k</span>
            </span>
            <span class="post-meta-item" title="阅读时长">
              <span class="post-meta-item-icon">
                <i class="far fa-clock"></i>
              </span>
                <span class="post-meta-item-text">阅读时长 &asymp;</span>
              <span>3 分钟</span>
            </span>

        </div>
      </header>

    
    
    
    <div class="post-body" itemprop="articleBody">

      
          <p>文章作者:jqpeng<br>原文链接: <a target="_blank" rel="noopener" href="https://www.cnblogs.com/xiaoqi/p/hugegraph-cypher.html">hugegraph 支持sparql 与cypher</a></p>
<p>hugegraph 是百度开源的基于tinkerpop的图数据库，支持通过gremlin进行查询。</p>
<p>这里，我们来扩展支持sparql 与cypher。</p>
<h2 id="sparql支持"><a href="#sparql支持" class="headerlink" title="sparql支持"></a>sparql支持</h2><p>github上有<code>SparqlToGremlinCompiler</code>，可以支持将sparql转GraphTraversal，集成该工具库即可：</p>
<pre><code>@Path(&quot;graphs/&#123;graph&#125;/sparql&quot;)
@Singleton
public class SparqlAPI extends API &#123;

    private static final Logger LOG = Log.logger(SparqlAPI.class);

    @GET
    @Timed
    @CompressInterceptor.Compress
    @Produces(APPLICATION_JSON_WITH_CHARSET)
    public String query(@Context GraphManager manager,
                        @PathParam(&quot;graph&quot;) String graph,
                        @QueryParam(&quot;sparql&quot;) String sparql) &#123;
        LOG.debug(&quot;Graph [&#123;&#125;] query by sparql: &#123;&#125;&quot;, graph, sparql);

        E.checkArgument(sparql != null &amp;&amp; !sparql.isEmpty(),
                &quot;The sparql parameter can&#39;t be null or empty&quot;);

        HugeGraph g = graph(manager, graph);
        GraphTraversal&lt;Vertex, ?&gt; traversal = SparqlToGremlinCompiler.convertToGremlinTraversal(g, sparql);
        List&lt;?&gt; result = traversal.toList();
        if (result.size() &gt; 0) &#123;
            Object item = result.get(0);
            if (item instanceof Vertex) &#123;
                return manager.serializer(g).writeVertices((Iterator&lt;Vertex&gt;) result.iterator(), false);
            &#125;
            if (item instanceof Map) &#123;
                return manager.serializer(g).writeMap((Map) item);
            &#125;
        &#125;

        return result.toString();
    &#125;
&#125;
</code></pre>
<h2 id="cypher-支持"><a href="#cypher-支持" class="headerlink" title="cypher 支持"></a>cypher 支持</h2><p>opencypher 提供了<code>translation</code>包，支持将cypher转为gremlin：</p>
<pre><code>        &lt;dependency&gt;
            &lt;groupId&gt;org.opencypher.gremlin&lt;/groupId&gt;
            &lt;artifactId&gt;translation&lt;/artifactId&gt;
            &lt;version&gt;1.0.4&lt;/version&gt;
        &lt;/dependency&gt;
</code></pre>
<p>转换代码：</p>
<pre><code> TranslationFacade cfog = new TranslationFacade();
 String gremlin = cfog.toGremlinGroovy(cypher);
</code></pre>
<p>增加api代码</p>
<pre><code>     @GET
    @Timed
    @CompressInterceptor.Compress
    @Produces(APPLICATION_JSON_WITH_CHARSET)
    public Response query(@Context GraphManager manager,
                          @PathParam(&quot;graph&quot;) String graph,
                          @Context HugeConfig conf,
                          @Context HttpHeaders headers,
                          @QueryParam(&quot;cypher&quot;) String cypher) &#123;
        LOG.debug(&quot;Graph [&#123;&#125;] query by cypher: &#123;&#125;&quot;, graph, cypher);

        return getResponse(graph, headers, cypher);
    &#125;

    private Response getResponse(@PathParam(&quot;graph&quot;) String graph, @Context HttpHeaders headers, @QueryParam(&quot;cypher&quot;) String cypher) &#123;
        E.checkArgument(cypher != null &amp;&amp; !cypher.isEmpty(),
                &quot;The cypher parameter can&#39;t be null or empty&quot;);

        TranslationFacade cfog = new TranslationFacade();
        String gremlin = cfog.toGremlinGroovy(cypher);
        gremlin = &quot;g = &quot; + graph + &quot;.traversal()\n&quot; + gremlin;
        String auth = headers.getHeaderString(HttpHeaders.AUTHORIZATION);
        MultivaluedMap&lt;String, String&gt; params = new MultivaluedHashMap&lt;&gt;();
        params.put(&quot;gremlin&quot;, Arrays.asList(gremlin));
        Response response = this.client().doGetRequest(auth, params);
        return transformResponseIfNeeded(response);
    &#125;
</code></pre>
<hr>
<blockquote>
<p>作者：Jadepeng<br> 出处：jqpeng的技术记事本–<a target="_blank" rel="noopener" href="http://www.cnblogs.com/xiaoqi">http://www.cnblogs.com/xiaoqi</a><br> 您的支持是对博主最大的鼓励，感谢您的认真阅读。<br> 本文版权归作者所有，欢迎转载，但未经作者同意必须保留此段声明，且在文章页面明显位置给出原文连接，否则保留追究法律责任的权利。</p>
</blockquote>

      
    </div>

    
    
    
      <footer class="post-footer">
        <div class="post-eof"></div>
      </footer>
  </article>
  
  
  

      
  
  
  <article itemscope itemtype="http://schema.org/Article" class="post-block" lang="zh-CN">
    <link itemprop="mainEntityOfPage" href="http://blog.iflyresearch.com/2020/11/17/jqpeng-%E5%9B%BE%E6%95%B0%E6%8D%AE%E5%BA%93%E6%9F%A5%E8%AF%A2%E8%AF%AD%E8%A8%80/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="image" content="/jadepeng/images/avatar.gif">
      <meta itemprop="name" content="JadePeng">
      <meta itemprop="description" content="JadePeng的技术笔记本">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="JadePeng的技术笔记本">
    </span>
      <header class="post-header">
        <h2 class="post-title" itemprop="name headline">
          
            <a href="/jadepeng/2020/11/17/jqpeng-%E5%9B%BE%E6%95%B0%E6%8D%AE%E5%BA%93%E6%9F%A5%E8%AF%A2%E8%AF%AD%E8%A8%80/" class="post-title-link" itemprop="url">图数据库查询语言</a>
        </h2>

        <div class="post-meta">

         
            <span class="post-meta-item">
              <span class="post-meta-item-icon">
                <i class="far fa-calendar"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>

              <time title="创建时间：2020-11-17 14:48:00" itemprop="dateCreated datePublished" datetime="2020-11-17T14:48:00+08:00">2020-11-17</time>
            </span>
              <span class="post-meta-item">
                <span class="post-meta-item-icon">
                  <i class="far fa-calendar-check"></i>
                </span>
                <span class="post-meta-item-text">更新于</span>
                <time title="修改时间：2021-07-12 21:28:27" itemprop="dateModified" datetime="2021-07-12T21:28:27+08:00">2021-07-12</time>
              </span>
            <span class="post-meta-item">
              <span class="post-meta-item-icon">
                <i class="far fa-folder"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/jadepeng/categories/%E5%8D%9A%E5%AE%A2/" itemprop="url" rel="index"><span itemprop="name">博客</span></a>
                </span>
                  ，
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/jadepeng/categories/%E5%8D%9A%E5%AE%A2/jqpeng/" itemprop="url" rel="index"><span itemprop="name">jqpeng</span></a>
                </span>
            </span>

          <br>
            <span class="post-meta-item" title="本文字数">
              <span class="post-meta-item-icon">
                <i class="far fa-file-word"></i>
              </span>
                <span class="post-meta-item-text">本文字数：</span>
              <span>7.7k</span>
            </span>
            <span class="post-meta-item" title="阅读时长">
              <span class="post-meta-item-icon">
                <i class="far fa-clock"></i>
              </span>
                <span class="post-meta-item-text">阅读时长 &asymp;</span>
              <span>7 分钟</span>
            </span>

        </div>
      </header>

    
    
    
    <div class="post-body" itemprop="articleBody">

      
          <p>文章作者:jqpeng<br>原文链接: <a target="_blank" rel="noopener" href="https://www.cnblogs.com/xiaoqi/p/graph-query-lang.html">图数据库查询语言</a></p>
<p>本文介绍图数据库支持的gremlin和Cypher查询语言。</p>
<h2 id="初始化数据"><a href="#初始化数据" class="headerlink" title="初始化数据"></a>初始化数据</h2><p>可使用gremlin api执行</p>
<h2 id="gremlin-api"><a href="#gremlin-api" class="headerlink" title="gremlin api"></a>gremlin api</h2><p>POST <a target="_blank" rel="noopener" href="http://localhost:8080/gremlin">http://localhost:8080/gremlin</a></p>
<pre><code>&#123;&quot;gremlin&quot;:&quot;这里是语句&quot;,
 &quot;bindings&quot;: &#123;&#125;,
&quot;language&quot;: &quot;gremlin-groovy&quot;,
&quot;aliases&quot;: &#123;    &quot;graph&quot;: &quot;graphname&quot;,     &quot;g&quot;: &quot;__g_graphname&quot;&#125;
&#125;
</code></pre>
<h3 id="schema"><a href="#schema" class="headerlink" title="schema"></a>schema</h3><pre><code>schema = hugegraph.schema()

schema.propertyKey(&quot;name&quot;).asText().ifNotExist().create()
schema.propertyKey(&quot;age&quot;).asInt().ifNotExist().create()
schema.propertyKey(&quot;time&quot;).asInt().ifNotExist().create()
schema.propertyKey(&quot;reason&quot;).asText().ifNotExist().create()
schema.propertyKey(&quot;type&quot;).asText().ifNotExist().create()

schema.vertexLabel(&quot;character&quot;).properties(&quot;name&quot;, &quot;age&quot;, &quot;type&quot;).primaryKeys(&quot;name&quot;).nullableKeys(&quot;age&quot;).ifNotExist().create()
schema.vertexLabel(&quot;location&quot;).properties(&quot;name&quot;).primaryKeys(&quot;name&quot;).ifNotExist().create()

schema.edgeLabel(&quot;father&quot;).link(&quot;character&quot;, &quot;character&quot;).ifNotExist().create()
schema.edgeLabel(&quot;mother&quot;).link(&quot;character&quot;, &quot;character&quot;).ifNotExist().create()
schema.edgeLabel(&quot;battled&quot;).link(&quot;character&quot;, &quot;character&quot;).properties(&quot;time&quot;).ifNotExist().create()
schema.edgeLabel(&quot;lives&quot;).link(&quot;character&quot;, &quot;location&quot;).properties(&quot;reason&quot;).nullableKeys(&quot;reason&quot;).ifNotExist().create()
schema.edgeLabel(&quot;pet&quot;).link(&quot;character&quot;, &quot;character&quot;).ifNotExist().create()
schema.edgeLabel(&quot;brother&quot;).link(&quot;character&quot;, &quot;character&quot;).ifNotExist().create()
</code></pre>
<h3 id="插入数据"><a href="#插入数据" class="headerlink" title="插入数据"></a>插入数据</h3><pre><code>// add vertices
Vertex saturn = graph.addVertex(T.label, &quot;character&quot;, &quot;name&quot;, &quot;saturn&quot;, &quot;age&quot;, 10000, &quot;type&quot;, &quot;titan&quot;)
Vertex sky = graph.addVertex(T.label, &quot;location&quot;, &quot;name&quot;, &quot;sky&quot;)
Vertex sea = graph.addVertex(T.label, &quot;location&quot;, &quot;name&quot;, &quot;sea&quot;)
Vertex jupiter = graph.addVertex(T.label, &quot;character&quot;, &quot;name&quot;, &quot;jupiter&quot;, &quot;age&quot;, 5000, &quot;type&quot;, &quot;god&quot;)
Vertex neptune = graph.addVertex(T.label, &quot;character&quot;, &quot;name&quot;, &quot;neptune&quot;, &quot;age&quot;, 4500, &quot;type&quot;, &quot;god&quot;)
Vertex hercules = graph.addVertex(T.label, &quot;character&quot;, &quot;name&quot;, &quot;hercules&quot;, &quot;age&quot;, 30, &quot;type&quot;, &quot;demigod&quot;)
Vertex alcmene = graph.addVertex(T.label, &quot;character&quot;, &quot;name&quot;, &quot;alcmene&quot;, &quot;age&quot;, 45, &quot;type&quot;, &quot;human&quot;)
Vertex pluto = graph.addVertex(T.label, &quot;character&quot;, &quot;name&quot;, &quot;pluto&quot;, &quot;age&quot;, 4000, &quot;type&quot;, &quot;god&quot;)
Vertex nemean = graph.addVertex(T.label, &quot;character&quot;, &quot;name&quot;, &quot;nemean&quot;, &quot;type&quot;, &quot;monster&quot;)
Vertex hydra = graph.addVertex(T.label, &quot;character&quot;, &quot;name&quot;, &quot;hydra&quot;, &quot;type&quot;, &quot;monster&quot;)
Vertex cerberus = graph.addVertex(T.label, &quot;character&quot;, &quot;name&quot;, &quot;cerberus&quot;, &quot;type&quot;, &quot;monster&quot;)
Vertex tartarus = graph.addVertex(T.label, &quot;location&quot;, &quot;name&quot;, &quot;tartarus&quot;)

// add edges
jupiter.addEdge(&quot;father&quot;, saturn)
jupiter.addEdge(&quot;lives&quot;, sky, &quot;reason&quot;, &quot;loves fresh breezes&quot;)
jupiter.addEdge(&quot;brother&quot;, neptune)
jupiter.addEdge(&quot;brother&quot;, pluto)
neptune.addEdge(&quot;lives&quot;, sea, &quot;reason&quot;, &quot;loves waves&quot;)
neptune.addEdge(&quot;brother&quot;, jupiter)
neptune.addEdge(&quot;brother&quot;, pluto)
hercules.addEdge(&quot;father&quot;, jupiter)
hercules.addEdge(&quot;mother&quot;, alcmene)
hercules.addEdge(&quot;battled&quot;, nemean, &quot;time&quot;, 1)
hercules.addEdge(&quot;battled&quot;, hydra, &quot;time&quot;, 2)
hercules.addEdge(&quot;battled&quot;, cerberus, &quot;time&quot;, 12)
pluto.addEdge(&quot;brother&quot;, jupiter)
pluto.addEdge(&quot;brother&quot;, neptune)
pluto.addEdge(&quot;lives&quot;, tartarus, &quot;reason&quot;, &quot;no fear of death&quot;)
pluto.addEdge(&quot;pet&quot;, cerberus)
cerberus.addEdge(&quot;lives&quot;, tartarus)
</code></pre>
<p><img src="https://gitee.com/jadepeng/pic/raw/master/pic/2020/11/17/1605595541783.png" alt="可视化"></p>
<h2 id="创建索引"><a href="#创建索引" class="headerlink" title="创建索引"></a>创建索引</h2><p>创建索引，使用REST API：</p>
<p>POST <a target="_blank" rel="noopener" href="http://localhost:8080/graphs/hugegraph/schema/indexlabels">http://localhost:8080/graphs/hugegraph/schema/indexlabels</a></p>
<pre><code>&#123;&quot;name&quot;: &quot;characterAge&quot;,&quot;base_type&quot;: &quot;VERTEX_LABEL&quot;,&quot;base_value&quot;: &quot;character&quot;,&quot;index_type&quot;: &quot;RANGE&quot;,&quot;fields&quot;: [    &quot;age&quot;]
&#125;
</code></pre>
<h2 id="查询"><a href="#查询" class="headerlink" title="查询"></a>查询</h2><h3 id="API-说明"><a href="#API-说明" class="headerlink" title="API 说明"></a>API 说明</h3><p>支持<code>gremlin</code>、<code>sparql</code>和<code>Cypher</code> api，推荐gremlin和Cypher</p>
<h4 id="cypher-api"><a href="#cypher-api" class="headerlink" title="cypher api"></a>cypher api</h4><pre><code>http://127.0.0.1:8080/graphs/hugegraph/cypher?cypher=
</code></pre>
<p>eg:</p>
<pre><code>curl http://127.0.0.1:8080/graphs/hugegraph/cypher?cypher=MATCH%20(n:character)-[:lives]-%3E(location)-[:lives]-(cohabitants)%20where%20n.name=%27pluto%27%20return%20cohabitants.name
</code></pre>
<h4 id="gremlin-api-1"><a href="#gremlin-api-1" class="headerlink" title="gremlin api"></a>gremlin api</h4><p>POST <a target="_blank" rel="noopener" href="http://localhost:8080/gremlin">http://localhost:8080/gremlin</a></p>
<pre><code>&#123;&quot;gremlin&quot;:&quot;这里是语句&quot;,
 &quot;bindings&quot;: &#123;&#125;,
&quot;language&quot;: &quot;gremlin-groovy&quot;,
&quot;aliases&quot;: &#123;    &quot;graph&quot;: &quot;graphname&quot;,     &quot;g&quot;: &quot;__g_graphname&quot;&#125;
&#125;
</code></pre>
<h4 id="sparql-api"><a href="#sparql-api" class="headerlink" title="sparql api"></a>sparql api</h4><pre><code>GET http://127.0.0.1:8080/graphs/hugegraph/sparql?sparql=SELECT%20*%20WHERE%20&#123;%20&#125;
</code></pre>
<p><strong>1. 查询hercules的祖父</strong></p>
<pre><code>g.V().hasLabel(&#39;character&#39;).has(&#39;name&#39;,&#39;hercules&#39;).out(&#39;father&#39;).out(&#39;father&#39;)
</code></pre>
<p>也可以通过<code>repeat</code>方式：</p>
<pre><code>g.V().hasLabel(&#39;character&#39;).has(&#39;name&#39;,&#39;hercules&#39;).repeat(__.out(&#39;father&#39;)).times(2)
</code></pre>
<p><strong>cypher</strong></p>
<pre><code>MATCH (n:character)-[:father]-&gt;()-[:father]-&gt;(grandfather) where n.name=&#39;hercules&#39; return grandfather
</code></pre>
<p><strong>2. Find the name of hercules’s father</strong></p>
<pre><code>g.V().hasLabel(&#39;character&#39;).has(&#39;name&#39;,&#39;hercules&#39;).out(&#39;father&#39;).value(&#39;name&#39;)
</code></pre>
<p><strong>cypher</strong></p>
<pre><code>MATCH (n:character)-[:father]-&gt;(father) where n.name=&#39;hercules&#39; return father.name
</code></pre>
<p><strong>3. Find the characters with age &gt; 100</strong></p>
<pre><code>g.V().hasLabel(&#39;character&#39;).has(&#39;age&#39;,gt(100))
</code></pre>
<p><strong>cypher</strong></p>
<pre><code>MATCH (n:character) where n.age &gt; 10 return n
</code></pre>
<p><strong>4. Find who are pluto’s cohabitants</strong></p>
<pre><code>g.V().hasLabel(&#39;character&#39;).has(&#39;name&#39;,&#39;pluto&#39;).out(&#39;lives&#39;).in(&#39;lives&#39;).values(&#39;name&#39;)
</code></pre>
<p><strong>cypher</strong></p>
<pre><code>MATCH (n:character)-[:lives]-&gt;(location)-[:lives]-(cohabitants) where n.name=&#39;pluto&#39; return cohabitants.name
</code></pre>
<p><strong>5. Find pluto can’t be his own cohabitant</strong></p>
<pre><code>pluto = g.V().hasLabel(&#39;character&#39;).has(&#39;name&#39;, &#39;pluto&#39;)
g.V(pluto).out(&#39;lives&#39;).in(&#39;lives&#39;).where(is(neq(pluto)).values(&#39;name&#39;)

// use &#39;as&#39;
g.V().hasLabel(&#39;character&#39;).has(&#39;name&#39;, &#39;pluto&#39;).as(&#39;x&#39;).out(&#39;lives&#39;).in(&#39;lives&#39;).where(neq(&#39;x&#39;)).values(&#39;name&#39;)




cypher&gt; MATCH (src:character&#123;name:&quot;pluto&quot;&#125;)-[:lives]-&gt;()&lt;-[:lives]-(dst:character) RETURN dst.name
</code></pre>
<p><strong>6. Pluto’s Brothers</strong></p>
<pre><code>pluto = g.V().hasLabel(&#39;character&#39;).has(&#39;name&#39;, &#39;pluto&#39;).next()
// where do pluto&#39;s brothers live?
g.V(pluto).out(&#39;brother&#39;).out(&#39;lives&#39;).values(&#39;name&#39;)

// which brother lives in which place?
g.V(pluto).out(&#39;brother&#39;).as(&#39;god&#39;).out(&#39;lives&#39;).as(&#39;place&#39;).select(&#39;god&#39;,&#39;place&#39;)

// what is the name of the brother and the name of the place?
g.V(pluto).out(&#39;brother&#39;).as(&#39;god&#39;).out(&#39;lives&#39;).as(&#39;place&#39;).select(&#39;god&#39;,&#39;place&#39;).by(&#39;name&#39;)



MATCH (src:Character&#123;name:&quot;pluto&quot;&#125;)-[:brother]-&gt;(bro:Character)-[:lives]-&gt;(dst)
RETURN bro.name, dst.name
</code></pre>
<hr>
<blockquote>
<p>作者：Jadepeng<br> 出处：jqpeng的技术记事本–<a target="_blank" rel="noopener" href="http://www.cnblogs.com/xiaoqi">http://www.cnblogs.com/xiaoqi</a><br> 您的支持是对博主最大的鼓励，感谢您的认真阅读。<br> 本文版权归作者所有，欢迎转载，但未经作者同意必须保留此段声明，且在文章页面明显位置给出原文连接，否则保留追究法律责任的权利。</p>
</blockquote>

      
    </div>

    
    
    
      <footer class="post-footer">
        <div class="post-eof"></div>
      </footer>
  </article>
  
  
  

      
  
  
  <article itemscope itemtype="http://schema.org/Article" class="post-block" lang="zh-CN">
    <link itemprop="mainEntityOfPage" href="http://blog.iflyresearch.com/2020/11/04/jqpeng-axios%20%E6%B5%8F%E8%A7%88%E5%99%A8%E5%86%85%E5%AD%98%E6%B3%84%E9%9C%B2%E9%97%AE%E9%A2%98%E8%A7%A3%E5%86%B3/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="image" content="/jadepeng/images/avatar.gif">
      <meta itemprop="name" content="JadePeng">
      <meta itemprop="description" content="JadePeng的技术笔记本">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="JadePeng的技术笔记本">
    </span>
      <header class="post-header">
        <h2 class="post-title" itemprop="name headline">
          
            <a href="/jadepeng/2020/11/04/jqpeng-axios%20%E6%B5%8F%E8%A7%88%E5%99%A8%E5%86%85%E5%AD%98%E6%B3%84%E9%9C%B2%E9%97%AE%E9%A2%98%E8%A7%A3%E5%86%B3/" class="post-title-link" itemprop="url">axios 浏览器内存泄露问题解决</a>
        </h2>

        <div class="post-meta">

         
            <span class="post-meta-item">
              <span class="post-meta-item-icon">
                <i class="far fa-calendar"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>

              <time title="创建时间：2020-11-04 11:53:00" itemprop="dateCreated datePublished" datetime="2020-11-04T11:53:00+08:00">2020-11-04</time>
            </span>
              <span class="post-meta-item">
                <span class="post-meta-item-icon">
                  <i class="far fa-calendar-check"></i>
                </span>
                <span class="post-meta-item-text">更新于</span>
                <time title="修改时间：2021-07-12 21:28:27" itemprop="dateModified" datetime="2021-07-12T21:28:27+08:00">2021-07-12</time>
              </span>
            <span class="post-meta-item">
              <span class="post-meta-item-icon">
                <i class="far fa-folder"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/jadepeng/categories/%E5%8D%9A%E5%AE%A2/" itemprop="url" rel="index"><span itemprop="name">博客</span></a>
                </span>
                  ，
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/jadepeng/categories/%E5%8D%9A%E5%AE%A2/jqpeng/" itemprop="url" rel="index"><span itemprop="name">jqpeng</span></a>
                </span>
            </span>

          <br>
            <span class="post-meta-item" title="本文字数">
              <span class="post-meta-item-icon">
                <i class="far fa-file-word"></i>
              </span>
                <span class="post-meta-item-text">本文字数：</span>
              <span>868</span>
            </span>
            <span class="post-meta-item" title="阅读时长">
              <span class="post-meta-item-icon">
                <i class="far fa-clock"></i>
              </span>
                <span class="post-meta-item-text">阅读时长 &asymp;</span>
              <span>1 分钟</span>
            </span>

        </div>
      </header>

    
    
    
    <div class="post-body" itemprop="articleBody">

      
          <p>文章作者:jqpeng<br>原文链接: <a target="_blank" rel="noopener" href="https://www.cnblogs.com/xiaoqi/p/axios-memory-leaks.html">axios 浏览器内存泄露问题解决</a></p>
<h2 id="现象"><a href="#现象" class="headerlink" title="现象"></a>现象</h2><p>业务页面，频繁切换下一条，内存飙涨，导致卡顿，之前怀疑是音频播放器的锅，修改后问题依旧，于是排查网络请求。</p>
<p>到axios issues搜索，发现<code>memory leaks</code>帖子不少，典型的在这里<a target="_blank" rel="noopener" href="https://github.com/axios/axios/issues/3217">Axios doesn’t address memory leaks?</a>:</p>
<p>这里提到<code>0.19.2 </code>版本没有问题，但是升级到<code>0.20.0</code>后，出现问题。</p>
<h2 id="两种解决方案："><a href="#两种解决方案：" class="headerlink" title="两种解决方案："></a>两种解决方案：</h2><ul>
<li>降级到<code>0.19.2 </code></li>
<li>在新版本里，不要直接使用axios，而是先创建一个instance</li>
</ul>
<pre><code>const axios = axios.create(&#123;...&#125;) // instead of axios.get(), post(), put() etc.
</code></pre>
<p>排查业务代码，发现每次请求都是创建一个 instance，抛开版本问题，每次创建实例肯定会存在内存问题，最好还是先创建个single instance，后面复用：</p>
<pre><code>import axios, &#123; AxiosRequestConfig, AxiosResponse &#125; from &#39;axios&#39;

// 创建一个实例
const axiosInstance = axios.create() 

  save(parameters: &#123;
    &#39;data&#39;: ResultSaveParam,
    $queryParameters?: any,
    $domain?: string
  &#125;): Promise&lt;AxiosResponse&lt;ApiResult&gt;&gt; &#123;
     .... // 使用axiosInstance
    return axiosInstance.request(config)
  &#125;
</code></pre>
<hr>
<blockquote>
<p>作者：Jadepeng<br> 出处：jqpeng的技术记事本–<a target="_blank" rel="noopener" href="http://www.cnblogs.com/xiaoqi">http://www.cnblogs.com/xiaoqi</a><br> 您的支持是对博主最大的鼓励，感谢您的认真阅读。<br> 本文版权归作者所有，欢迎转载，但未经作者同意必须保留此段声明，且在文章页面明显位置给出原文连接，否则保留追究法律责任的权利。</p>
</blockquote>

      
    </div>

    
    
    
      <footer class="post-footer">
        <div class="post-eof"></div>
      </footer>
  </article>
  
  
  

      
  
  
  <article itemscope itemtype="http://schema.org/Article" class="post-block" lang="zh-CN">
    <link itemprop="mainEntityOfPage" href="http://blog.iflyresearch.com/2020/11/02/jqpeng-%E7%BB%99Swagger%E6%8D%A2%E4%B8%80%E5%A5%97%E7%9A%AE%E8%82%A4%20Knife4j%E9%9B%86%E6%88%90%E8%AE%B0%E5%BD%95/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="image" content="/jadepeng/images/avatar.gif">
      <meta itemprop="name" content="JadePeng">
      <meta itemprop="description" content="JadePeng的技术笔记本">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="JadePeng的技术笔记本">
    </span>
      <header class="post-header">
        <h2 class="post-title" itemprop="name headline">
          
            <a href="/jadepeng/2020/11/02/jqpeng-%E7%BB%99Swagger%E6%8D%A2%E4%B8%80%E5%A5%97%E7%9A%AE%E8%82%A4%20Knife4j%E9%9B%86%E6%88%90%E8%AE%B0%E5%BD%95/" class="post-title-link" itemprop="url">给Swagger换一套皮肤 Knife4j集成记录</a>
        </h2>

        <div class="post-meta">

         
            <span class="post-meta-item">
              <span class="post-meta-item-icon">
                <i class="far fa-calendar"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>

              <time title="创建时间：2020-11-02 11:19:00" itemprop="dateCreated datePublished" datetime="2020-11-02T11:19:00+08:00">2020-11-02</time>
            </span>
              <span class="post-meta-item">
                <span class="post-meta-item-icon">
                  <i class="far fa-calendar-check"></i>
                </span>
                <span class="post-meta-item-text">更新于</span>
                <time title="修改时间：2021-07-12 21:28:27" itemprop="dateModified" datetime="2021-07-12T21:28:27+08:00">2021-07-12</time>
              </span>
            <span class="post-meta-item">
              <span class="post-meta-item-icon">
                <i class="far fa-folder"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/jadepeng/categories/%E5%8D%9A%E5%AE%A2/" itemprop="url" rel="index"><span itemprop="name">博客</span></a>
                </span>
                  ，
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/jadepeng/categories/%E5%8D%9A%E5%AE%A2/jqpeng/" itemprop="url" rel="index"><span itemprop="name">jqpeng</span></a>
                </span>
            </span>

          <br>
            <span class="post-meta-item" title="本文字数">
              <span class="post-meta-item-icon">
                <i class="far fa-file-word"></i>
              </span>
                <span class="post-meta-item-text">本文字数：</span>
              <span>2k</span>
            </span>
            <span class="post-meta-item" title="阅读时长">
              <span class="post-meta-item-icon">
                <i class="far fa-clock"></i>
              </span>
                <span class="post-meta-item-text">阅读时长 &asymp;</span>
              <span>2 分钟</span>
            </span>

        </div>
      </header>

    
    
    
    <div class="post-body" itemprop="articleBody">

      
          <p>文章作者:jqpeng<br>原文链接: <a target="_blank" rel="noopener" href="https://www.cnblogs.com/xiaoqi/p/Knife4j.html">给Swagger换一套皮肤 Knife4j集成记录</a></p>
<p>Swagger有一套经典的UI，但是并不是很好用，之前有看到Knife4j，界面美观、功能完善，因此尝试集成。</p>
<p>demo参考示例地址：<a target="_blank" rel="noopener" href="https://gitee.com/xiaoym/swagger-bootstrap-ui-demo/tree/master/knife4j-spring-boot-demo">knife4j-spring-boot-demo</a></p>
<p>Knife4j前身是swagger-bootstrap-ui,是一个为Swagger接口文档赋能的工具</p>
<p>根据官方文档，集成非常方便。</p>
<h2 id="maven引用"><a href="#maven引用" class="headerlink" title="maven引用"></a>maven引用</h2><p>第一步,是在项目的<code>pom.xml</code>文件中引入<code>knife4j</code>的依赖,如下：</p>
<pre><code>&lt;dependencies&gt;
    &lt;dependency&gt;
        &lt;groupId&gt;com.github.xiaoymin&lt;/groupId&gt;
        &lt;artifactId&gt;knife4j-spring-boot-starter&lt;/artifactId&gt;
        &lt;version&gt;2.0.6&lt;/version&gt;
    &lt;/dependency&gt;
&lt;/dependencies&gt;
</code></pre>
<p>当前最新版是2.0.6</p>
<p>如果你想使用bom的方式引入,请参考<a target="_blank" rel="noopener" href="https://doc.xiaominfo.com/knife4j/mavenbom.html">Maven Bom方式引用</a></p>
<h2 id="创建Swagger配置文件"><a href="#创建Swagger配置文件" class="headerlink" title="创建Swagger配置文件"></a>创建Swagger配置文件</h2><p>新建Swagger的配置文件<code>SwaggerConfiguration.java</code>文件,创建springfox提供的Docket分组对象,代码如下：</p>
<pre><code>@Configuration
@EnableSwagger2
@EnableKnife4j
@Import(BeanValidatorPluginsConfiguration.class)
public class SwaggerConfiguration &#123;

    @Bean(value = &quot;defaultApi2&quot;)
    public Docket defaultApi2() &#123;
        Docket docket=new Docket(DocumentationType.SWAGGER_2)
                .apiInfo(apiInfo())
                //分组名称
                .groupName(&quot;2.X版本&quot;)
                .select()
                //这里指定Controller扫描包路径
                .apis(RequestHandlerSelectors.basePackage(&quot;com.swagger.bootstrap.ui.demo.new2&quot;))
                .paths(PathSelectors.any())
                .build();
        return docket;
    &#125;

&#125;
</code></pre>
<p>以上有两个注解需要特别说明，如下表：</p>
<table>
<thead>
<tr>
<th>注解</th>
<th>说明</th>
</tr>
</thead>
<tbody><tr>
<td><code>@EnableSwagger2</code></td>
<td>该注解是Springfox-swagger框架提供的使用Swagger注解，该注解必须加</td>
</tr>
<tr>
<td><code>@EnableKnife4j</code></td>
<td>该注解是<code>knife4j</code>提供的增强注解,Ui提供了例如动态参数、参数过滤、接口排序等增强功能,如果你想使用这些增强功能就必须加该注解，否则可以不用加</td>
</tr>
</tbody></table>
<h2 id="spring-security-免认证"><a href="#spring-security-免认证" class="headerlink" title="spring-security 免认证"></a>spring-security 免认证</h2><p>将<code>/**/doc.html/**</code> 加入：</p>
<pre><code>    private String[] getSwaggerUrl() &#123;
        List&lt;String&gt; urls = new ArrayList&lt;String&gt;();
        urls.add(&quot;/**/swagger-resources/**&quot;);
        urls.add(&quot;/**/webjars/**&quot;);
        urls.add(&quot;/**/doc.html/**&quot;);
        urls.add(&quot;/**/v2/**&quot;);
        urls.add(&quot;/**/swagger-ui.html/**&quot;);
        return urls.toArray(new String[urls.size()]);
    &#125;http.authorizeRequests() .antMatchers(getSwaggerUrl()).permitAll()
</code></pre>
<h2 id="测试访问"><a href="#测试访问" class="headerlink" title="测试访问"></a>测试访问</h2><p>在浏览器输入地址：<code>http://host:port/doc.html</code></p>
<p>可以设置全局参数：</p>
<p><img src="https://gitee.com/jadepeng/pic/raw/master/pic/2020/11/2/1604286718931.png" alt="全局参数"></p>
<p>支持在线调试</p>
<p><img src="https://gitee.com/jadepeng/pic/raw/master/pic/2020/11/2/1604286643402.png" alt="在线调试"></p>
<p>离线文档支持导出md、pdf等</p>
<p><img src="https://gitee.com/jadepeng/pic/raw/master/pic/2020/11/2/1604286760474.png" alt="导出文档"></p>
<h2 id="最后"><a href="#最后" class="headerlink" title="最后"></a>最后</h2><p>前端如何更优雅的调用api呢？参考：</p>
<p><a target="_blank" rel="noopener" href="https://www.cnblogs.com/xiaoqi/p/generator-swagger-2-ts-2.html">Vue 使用typescript， 优雅的调用swagger API</a></p>
<p>后面有空，可以将这个集成到knife4j</p>
<hr>
<blockquote>
<p>作者：Jadepeng<br> 出处：jqpeng的技术记事本–<a target="_blank" rel="noopener" href="http://www.cnblogs.com/xiaoqi">http://www.cnblogs.com/xiaoqi</a><br> 您的支持是对博主最大的鼓励，感谢您的认真阅读。<br> 本文版权归作者所有，欢迎转载，但未经作者同意必须保留此段声明，且在文章页面明显位置给出原文连接，否则保留追究法律责任的权利。</p>
</blockquote>

      
    </div>

    
    
    
      <footer class="post-footer">
        <div class="post-eof"></div>
      </footer>
  </article>
  
  
  

      
  
  
  <article itemscope itemtype="http://schema.org/Article" class="post-block" lang="zh-CN">
    <link itemprop="mainEntityOfPage" href="http://blog.iflyresearch.com/2020/10/16/jqpeng-%E6%8E%A8%E8%8D%90%E7%AE%97%E6%B3%95%E4%B9%8B%EF%BC%9A%20DeepFM%E5%8F%8A%E4%BD%BF%E7%94%A8DeepCTR%E6%B5%8B%E8%AF%95/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="image" content="/jadepeng/images/avatar.gif">
      <meta itemprop="name" content="JadePeng">
      <meta itemprop="description" content="JadePeng的技术笔记本">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="JadePeng的技术笔记本">
    </span>
      <header class="post-header">
        <h2 class="post-title" itemprop="name headline">
          
            <a href="/jadepeng/2020/10/16/jqpeng-%E6%8E%A8%E8%8D%90%E7%AE%97%E6%B3%95%E4%B9%8B%EF%BC%9A%20DeepFM%E5%8F%8A%E4%BD%BF%E7%94%A8DeepCTR%E6%B5%8B%E8%AF%95/" class="post-title-link" itemprop="url">推荐算法之： DeepFM及使用DeepCTR测试</a>
        </h2>

        <div class="post-meta">

         
            <span class="post-meta-item">
              <span class="post-meta-item-icon">
                <i class="far fa-calendar"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>

              <time title="创建时间：2020-10-16 14:21:00" itemprop="dateCreated datePublished" datetime="2020-10-16T14:21:00+08:00">2020-10-16</time>
            </span>
              <span class="post-meta-item">
                <span class="post-meta-item-icon">
                  <i class="far fa-calendar-check"></i>
                </span>
                <span class="post-meta-item-text">更新于</span>
                <time title="修改时间：2021-07-12 21:28:27" itemprop="dateModified" datetime="2021-07-12T21:28:27+08:00">2021-07-12</time>
              </span>
            <span class="post-meta-item">
              <span class="post-meta-item-icon">
                <i class="far fa-folder"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/jadepeng/categories/%E5%8D%9A%E5%AE%A2/" itemprop="url" rel="index"><span itemprop="name">博客</span></a>
                </span>
                  ，
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/jadepeng/categories/%E5%8D%9A%E5%AE%A2/jqpeng/" itemprop="url" rel="index"><span itemprop="name">jqpeng</span></a>
                </span>
            </span>

          <br>
            <span class="post-meta-item" title="本文字数">
              <span class="post-meta-item-icon">
                <i class="far fa-file-word"></i>
              </span>
                <span class="post-meta-item-text">本文字数：</span>
              <span>10k</span>
            </span>
            <span class="post-meta-item" title="阅读时长">
              <span class="post-meta-item-icon">
                <i class="far fa-clock"></i>
              </span>
                <span class="post-meta-item-text">阅读时长 &asymp;</span>
              <span>9 分钟</span>
            </span>

        </div>
      </header>

    
    
    
    <div class="post-body" itemprop="articleBody">

      
          <p>文章作者:jqpeng<br>原文链接: <a target="_blank" rel="noopener" href="https://www.cnblogs.com/xiaoqi/p/deepfm.html">推荐算法之： DeepFM及使用DeepCTR测试</a></p>
<h2 id="算法介绍"><a href="#算法介绍" class="headerlink" title="算法介绍"></a>算法介绍</h2><p>左边deep network，右边FM，所以叫deepFM</p>
<p><img src="https://gitee.com/jadepeng/pic/raw/master/pic/2020/10/15/1602764397990.png" alt="DeepFm"></p>
<p>包含两个部分：</p>
<ul>
<li>Part1： FM(Factorization machines)，因子分解机部分</li>
</ul>
<p><img src="https://gitee.com/jadepeng/pic/raw/master/pic/2020/10/15/1602764448337.png" alt="FM"></p>
<p>在传统的一阶线性回归之上，加了一个二次项，可以表达两两特征的相互关系。</p>
<p><img src="https://gitee.com/jadepeng/pic/raw/master/pic/2020/10/15/1602764632765.png" alt="特征相互关系"></p>
<p>这里的公式可以简化，减少计算量，下图来至于网络。</p>
<p><img src="https://gitee.com/jadepeng/pic/raw/master/pic/2020/10/15/1602765047458.png" alt="FM"></p>
<ul>
<li>Part2： Deep部分</li>
</ul>
<p>deep部分是多层dnn网络。</p>
<h2 id="算法实现"><a href="#算法实现" class="headerlink" title="算法实现"></a>算法实现</h2><p>实现部分，<a target="_blank" rel="noopener" href="https://blog.csdn.net/songbinxu/article/details/80151814">用Keras实现一个DeepFM</a> 和<a target="_blank" rel="noopener" href="https://blog.csdn.net/u012969412/article/details/88684723">·清尘·《FM、FMM、DeepFM整理（pytorch）》</a></p>
<p>讲的比较清楚，这里引用keras实现来说明。</p>
<p>整体的网络结构：</p>
<p><img src="https://gitee.com/jadepeng/pic/raw/master/pic/2020/10/15/1602764969628.png" alt="网络结构"></p>
<h3 id="特征编码"><a href="#特征编码" class="headerlink" title="特征编码"></a>特征编码</h3><p>特征可以分为3类：</p>
<ul>
<li>连续型field，比如数字类型特征</li>
<li>单值离散型特征，比如gender，可选为male、female</li>
<li>多值离散型，比如tag，可以有多个</li>
</ul>
<p>连续型field，可以拼接到一起，dense数据。</p>
<p>单值，多值field进行Onehot后，可见单值离散field对应的独热向量只有一位取1，而多值离散field对应的独热向量有多于一位取1，表示该field可以同时取多个特征值。</p>
<table>
<thead>
<tr>
<th>label</th>
<th>shop_score</th>
<th>gender=m</th>
<th>gender=f</th>
<th>interest=f</th>
<th>interest=c</th>
</tr>
</thead>
<tbody><tr>
<td>0</td>
<td>0.2</td>
<td>1</td>
<td>0</td>
<td>1</td>
<td>1</td>
</tr>
<tr>
<td>1</td>
<td>0.8</td>
<td>0</td>
<td>1</td>
<td>0</td>
<td>1</td>
</tr>
</tbody></table>
<h3 id="FM-部分"><a href="#FM-部分" class="headerlink" title="FM 部分"></a>FM 部分</h3><p><img src="https://gitee.com/jadepeng/pic/raw/master/pic/2020/10/15/1602765456508.png" alt="FM"></p>
<p>看公式：<br><img src="https://gitee.com/jadepeng/pic/raw/master/pic/2020/10/15/1602764448337.png" alt="FM"></p>
<p>先算 FM一次项：</p>
<ul>
<li>连续型field 可以用Dense(1)层实现</li>
<li>单值离散型field 用Embedding(n,1), n是分类中值的个数</li>
<li>多值离散型field可以同时取多个特征值，为了batch training，必须对样本进行补零padding。同样可以用Embedding实现，因为有多个Embedding，可以取下平均值。</li>
</ul>
<p><img src="https://gitee.com/jadepeng/pic/raw/master/pic/2020/10/15/1602765746903.png" alt="1次项"></p>
<p>然后计算FM二次项，这里理解比较费劲一点。</p>
<p><a target="_blank" rel="noopener" href="https://blog.csdn.net/u012969412/article/details/88684723">·清尘·《FM、FMM、DeepFM整理（pytorch）》</a> 深入浅出的讲明白了这个过程，大家可以参见。</p>
<p>我们来看具体实现方面，这里的<a target="_blank" rel="noopener" href="http://fancyerii.github.io/2019/12/19/deepfm/#fm-layer">DeepFM模型CTR预估理论与实战</a> 讲解更容易理解。</p>
<p><img src="https://gitee.com/jadepeng/pic/raw/master/pic/2020/10/16/1602819038585.png" alt="FM公式"></p>
<p>假设只有前面的C1和C2两个Category的特征，词典大小还是3和2。假设输入还是C1=2，C2=2(下标从1开始)，则Embedding之后为V2=[e21,e22,e23,e24]和V5=[e51,e52,e53,e54]。</p>
<p>因为xi和xj同时不为零才需要计算，所以上面的公式里需要计算的只有i=2和j=5的情况。因此：</p>
<p><img src="https://gitee.com/jadepeng/pic/raw/master/pic/2020/10/16/1602819112460.png" alt="FM"></p>
<p>扩展到多个，比如C1,C2,C3，需要算内积</p>
<p><img src="https://gitee.com/jadepeng/pic/raw/master/pic/2020/10/16/1602819135487.png"></p>
<p>怎么用用矩阵乘法一次计算出来呢？我们可以看看这个</p>
<p><img src="https://gitee.com/jadepeng/pic/raw/master/pic/2020/10/16/1602819176970.png"></p>
<p>对应的代码就是</p>
<pre><code>       square_of_sum = tf.square(reduce_sum(        concated_embeds_value, axis=1, keep_dims=True))    sum_of_square = reduce_sum(        concated_embeds_value * concated_embeds_value, axis=1, keep_dims=True)    cross_term = square_of_sum - sum_of_square    cross_term = 0.5 * reduce_sum(cross_term, axis=2, keep_dims=False)
</code></pre>
<p>其中concated_embeds_value是拼接起来的embeds_value。</p>
<h3 id="Deep部分"><a href="#Deep部分" class="headerlink" title="Deep部分"></a>Deep部分</h3><p>DNN比较简单，FM的输入和DNN的输入都是同一个group_embedding_dict。</p>
<h2 id="使用movielens-来测试"><a href="#使用movielens-来测试" class="headerlink" title="使用movielens 来测试"></a>使用movielens 来测试</h2><p>下载<code>ml-100k</code> 数据集</p>
<pre><code>wget http://files.grouplens.org/datasets/movielens/ml-100k.zip
unzip ml-100k.zip
</code></pre>
<p>安装相关软件包，sklearn，deepctr</p>
<p>导入包：</p>
<pre><code>import pandas
import pandas as pd
import sklearn
from sklearn.metrics import log_loss, roc_auc_score
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder
from tensorflow.python.keras.preprocessing.sequence import pad_sequences
import tensorflow as tf
from tqdm import tqdm

from deepctr.models import DeepFM
from deepctr.feature_column import SparseFeat, VarLenSparseFeat, get_feature_names
import numpy as np
</code></pre>
<p>读取评分数据：</p>
<pre><code>u_data = pd.read_csv(&quot;ml-100k/u.data&quot;, sep=&#39;\t&#39;, header=None)
u_data.columns = [&#39;user_id&#39;, &#39;movie_id&#39;, &#39;rating&#39;, &#39;timestamp&#39;]
</code></pre>
<p>有评分的设置为1，随机采用未评分的</p>
<pre><code>def neg_sample(u_data, neg_rate=1):
    # 全局随机采样
    item_ids = u_data[&#39;movie_id&#39;].unique()
    print(&#39;start neg sample&#39;)
    neg_data = []
    # 负采样
    for user_id, hist in tqdm(u_data.groupby(&#39;user_id&#39;)):
        # 当前用户movie
        rated_movie_list = hist[&#39;movie_id&#39;].tolist()
        candidate_set = list(set(item_ids) - set(rated_movie_list))
        neg_list_id = np.random.choice(candidate_set, size=len(rated_movie_list) * neg_rate, replace=True)
        for id in neg_list_id:
            neg_data.append([user_id, id, -1, 0])
    u_data_neg = pd.DataFrame(neg_data)
    u_data_neg.columns = [&#39;user_id&#39;, &#39;movie_id&#39;, &#39;rating&#39;, &#39;timestamp&#39;]
    u_data = pandas.concat([u_data, u_data_neg])
    print(&#39;end neg sample&#39;)
    return u_data
</code></pre>
<p>读取item数据</p>
<pre><code>u_item = pd.read_csv(&quot;ml-100k/u.item&quot;, sep=&#39;|&#39;, header=None, error_bad_lines=False)
    genres_columns = [&#39;Action&#39;, &#39;Adventure&#39;,
                      &#39;Animation&#39;,
                      &#39;Children&#39;, &#39;Comedy&#39;, &#39;Crime&#39;, &#39;Documentary&#39;, &#39;Drama&#39;, &#39;Fantasy&#39;,
                      &#39;Film_Noir&#39;, &#39;Horror&#39;, &#39;Musical&#39;, &#39;Mystery&#39;, &#39;Romance&#39;, &#39;Sci-Fi&#39;,
                      &#39;Thriller&#39;, &#39;War&#39;, &#39;Western&#39;]

    u_item.columns = [&#39;movie_id&#39;, &#39;title&#39;, &#39;release_date&#39;, &#39;video_date&#39;, &#39;url&#39;, &#39;unknown&#39;] + genres_columns
</code></pre>
<p>处理genres并删除单独的genres列</p>
<pre><code>     genres_list = []
    for index, row in u_item.iterrows():
        genres = []
        for item in genres_columns:
            if row[item]:
                genres.append(item)
        genres_list.append(&#39;|&#39;.join(genres))

    u_item[&#39;genres&#39;] = genres_list
    for item in genres_columns:
        del u_item[item]
</code></pre>
<p>读取用户信息：</p>
<pre><code>  # user id | age | gender | occupation(职业) | zip code（邮编，地区)
    u_user = pd.read_csv(&quot;ml-100k/u.user&quot;, sep=&#39;|&#39;, header=None)
    u_user.columns = [&#39;user_id&#39;, &#39;age&#39;, &#39;gender&#39;, &#39;occupation&#39;, &#39;zip&#39;]
</code></pre>
<p>join到一起：</p>
<pre><code> data = pandas.merge(u_data, u_item, on=&quot;movie_id&quot;, how=&#39;left&#39;)
 data = pandas.merge(data, u_user, on=&quot;user_id&quot;, how=&#39;left&#39;)
 data.to_csv(&#39;ml-100k/data.csv&#39;, index=False)
</code></pre>
<p>处理特征：</p>
<pre><code>sparse_features = [&quot;movie_id&quot;, &quot;user_id&quot;,
                   &quot;gender&quot;, &quot;age&quot;, &quot;occupation&quot;, &quot;zip&quot;, ]

data[sparse_features] = data[sparse_features].astype(str)
target = [&#39;rating&#39;]

# 评分
data[&#39;rating&#39;] = [1 if int(x) &gt;= 0 else 0 for x in data[&#39;rating&#39;]]
</code></pre>
<p>先特征编码：</p>
<pre><code>for feat in sparse_features:    lbe = LabelEncoder()    data[feat] = lbe.fit_transform(data[feat])
</code></pre>
<p>处理genres特征，一个movie有多个genres，先拆分，然后编码为数字，注意是从1开始；由于每个movie的genres长度不一样，可以计算最大长度，位数不足的后面补零（pad_sequences，在post补0）</p>
<pre><code>     def split(x):        key_ans = x.split(&#39;|&#39;)        for key in key_ans:            if key not in key2index:                # Notice : input value 0 is a special &quot;padding&quot;,so we do not use 0 to encode valid feature for sequence input                key2index[key] = len(key2index) + 1        return list(map(lambda x: key2index[x], key_ans))

    key2index = &#123;&#125;    genres_list = list(map(split, data[&#39;genres&#39;].values))    genres_length = np.array(list(map(len, genres_list)))    max_len = max(genres_length)    # Notice : padding=`post`    genres_list = pad_sequences(genres_list, maxlen=max_len, padding=&#39;post&#39;, )
</code></pre>
<p>构建deepctr的特征列，主要分为两类特征，一是定长的SparseFeat，稀疏的类别特征，二是可变长度的VarLenSparseFeat，像genres这样的包含多个的。</p>
<pre><code>       fixlen_feature_columns = [SparseFeat(feat, data[feat].nunique(), embedding_dim=4)                              for feat in sparse_features]
    use_weighted_sequence = False    if use_weighted_sequence:        varlen_feature_columns = [VarLenSparseFeat(SparseFeat(&#39;genres&#39;, vocabulary_size=len(            key2index) + 1, embedding_dim=4), maxlen=max_len, combiner=&#39;mean&#39;,                                                   weight_name=&#39;genres_weight&#39;)]  # Notice : value 0 is for padding for sequence input feature    else:        varlen_feature_columns = [VarLenSparseFeat(SparseFeat(&#39;genres&#39;, vocabulary_size=len(            key2index) + 1, embedding_dim=4), maxlen=max_len, combiner=&#39;mean&#39;,                                                   weight_name=None)]  # Notice : value 0 is for padding for sequence input feature
    linear_feature_columns = fixlen_feature_columns + varlen_feature_columns    dnn_feature_columns = fixlen_feature_columns + varlen_feature_columns
    feature_names = get_feature_names(linear_feature_columns + dnn_feature_columns)
</code></pre>
<p>封装训练数据，先shuffle（乱排）数据，然后生成dict input数据。</p>
<pre><code>data = sklearn.utils.shuffle(data)
train_model_input = &#123;name: data[name] for name in sparse_features&#125;  #
train_model_input[&quot;genres&quot;] = genres_list
</code></pre>
<p>构建DeepFM模型，由于目标值是0,1，因此采用binary，损失函数用binary_crossentropy</p>
<pre><code>model = DeepFM(linear_feature_columns, dnn_feature_columns, task=&#39;binary&#39;)

model.compile(optimizer=tf.keras.optimizers.Adam(), loss=&#39;binary_crossentropy&#39;,
              metrics=[&#39;AUC&#39;, &#39;Precision&#39;, &#39;Recall&#39;])
model.summary()
</code></pre>
<p>训练模型：</p>
<pre><code>model.fit(train_model_input, data[target].values,                    batch_size=256, epochs=20, verbose=2,                    validation_split=0.2            )
</code></pre>
<p>开始训练：</p>
<pre><code>Epoch 1/20
625/625 - 3s - loss: 0.5081 - auc: 0.8279 - precision: 0.7419 - recall: 0.7695 - val_loss: 0.4745 - val_auc: 0.8513 - val_precision: 0.7563 - val_recall: 0.7936
Epoch 2/20
625/625 - 2s - loss: 0.4695 - auc: 0.8538 - precision: 0.7494 - recall: 0.8105 - val_loss: 0.4708 - val_auc: 0.8539 - val_precision: 0.7498 - val_recall: 0.8127
Epoch 3/20
625/625 - 2s - loss: 0.4652 - auc: 0.8564 - precision: 0.7513 - recall: 0.8139 - val_loss: 0.4704 - val_auc: 0.8545 - val_precision: 0.7561 - val_recall: 0.8017
Epoch 4/20
625/625 - 2s - loss: 0.4624 - auc: 0.8579 - precision: 0.7516 - recall: 0.8146 - val_loss: 0.4724 - val_auc: 0.8542 - val_precision: 0.7296 - val_recall: 0.8526
Epoch 5/20
625/625 - 2s - loss: 0.4607 - auc: 0.8590 - precision: 0.7521 - recall: 0.8173 - val_loss: 0.4699 - val_auc: 0.8550 - val_precision: 0.7511 - val_recall: 0.8141
Epoch 6/20
625/625 - 2s - loss: 0.4588 - auc: 0.8602 - precision: 0.7545 - recall: 0.8165 - val_loss: 0.4717 - val_auc: 0.8542 - val_precision: 0.7421 - val_recall: 0.8265
Epoch 7/20
625/625 - 2s - loss: 0.4574 - auc: 0.8610 - precision: 0.7535 - recall: 0.8192 - val_loss: 0.4722 - val_auc: 0.8547 - val_precision: 0.7549 - val_recall: 0.8023
Epoch 8/20
625/625 - 2s - loss: 0.4561 - auc: 0.8619 - precision: 0.7543 - recall: 0.8201 - val_loss: 0.4717 - val_auc: 0.8548 - val_precision: 0.7480 - val_recall: 0.8185
Epoch 9/20
625/625 - 2s - loss: 0.4531 - auc: 0.8643 - precision: 0.7573 - recall: 0.8210 - val_loss: 0.4696 - val_auc: 0.8583 - val_precision: 0.7598 - val_recall: 0.8103
Epoch 10/20
625/625 - 2s - loss: 0.4355 - auc: 0.8768 - precision: 0.7787 - recall: 0.8166 - val_loss: 0.4435 - val_auc: 0.8769 - val_precision: 0.7756 - val_recall: 0.8293
Epoch 11/20
625/625 - 2s - loss: 0.4093 - auc: 0.8923 - precision: 0.7915 - recall: 0.8373 - val_loss: 0.4301 - val_auc: 0.8840 - val_precision: 0.7806 - val_recall: 0.8390
Epoch 12/20
625/625 - 2s - loss: 0.3970 - auc: 0.8988 - precision: 0.7953 - recall: 0.8497 - val_loss: 0.4286 - val_auc: 0.8867 - val_precision: 0.7903 - val_recall: 0.8299
Epoch 13/20
625/625 - 2s - loss: 0.3896 - auc: 0.9029 - precision: 0.8001 - recall: 0.8542 - val_loss: 0.4253 - val_auc: 0.8888 - val_precision: 0.7913 - val_recall: 0.8322
Epoch 14/20
625/625 - 2s - loss: 0.3825 - auc: 0.9067 - precision: 0.8038 - recall: 0.8584 - val_loss: 0.4205 - val_auc: 0.8917 - val_precision: 0.7885 - val_recall: 0.8506
Epoch 15/20
625/625 - 2s - loss: 0.3755 - auc: 0.9102 - precision: 0.8074 - recall: 0.8624 - val_loss: 0.4204 - val_auc: 0.8940 - val_precision: 0.7868 - val_recall: 0.8607
Epoch 16/20
625/625 - 2s - loss: 0.3687 - auc: 0.9136 - precision: 0.8117 - recall: 0.8653 - val_loss: 0.4176 - val_auc: 0.8956 - val_precision: 0.8097 - val_recall: 0.8236
Epoch 17/20
625/625 - 2s - loss: 0.3617 - auc: 0.9170 - precision: 0.8155 - recall: 0.8682 - val_loss: 0.4166 - val_auc: 0.8966 - val_precision: 0.8056 - val_recall: 0.8354
Epoch 18/20
625/625 - 2s - loss: 0.3553 - auc: 0.9201 - precision: 0.8188 - recall: 0.8716 - val_loss: 0.4168 - val_auc: 0.8977 - val_precision: 0.7996 - val_recall: 0.8492
Epoch 19/20
625/625 - 2s - loss: 0.3497 - auc: 0.9227 - precision: 0.8214 - recall: 0.8741 - val_loss: 0.4187 - val_auc: 0.8973 - val_precision: 0.8079 - val_recall: 0.8358
Epoch 20/20
625/625 - 2s - loss: 0.3451 - auc: 0.9248 - precision: 0.8244 - recall: 0.8753 - val_loss: 0.4210 - val_auc: 0.8982 - val_precision: 0.7945 - val_recall: 0.8617
</code></pre>
<p>最后我们测试下数据：</p>
<pre><code> pred_ans = model.predict(train_model_input, batch_size=256)
 count = 0
    for (i, j) in zip(pred_ans, data[&#39;rating&#39;].values):
        print(i, j)
        count += 1
        if count &gt; 10:
            break
</code></pre>
<p>输出如下：</p>
<pre><code>[0.20468083] 0
[0.1988303] 0
[7.7236204e-05] 0
[0.9439401] 1
[0.76648283] 0
[0.80082995] 1
[0.7689271] 0
[0.8515004] 1
[0.93311656] 1
[0.40019292] 0
[0.60735244] 0
</code></pre>
<h2 id="参考"><a href="#参考" class="headerlink" title="参考"></a>参考</h2><ul>
<li><a target="_blank" rel="noopener" href="https://blog.csdn.net/w55100/article/details/90295932">deepFM in pytorch</a></li>
<li><a target="_blank" rel="noopener" href="https://blog.csdn.net/itplus/article/details/40534923">皮果提《Factorization Machines 学习笔记（二）模型方程》</a></li>
<li><a target="_blank" rel="noopener" href="https://blog.csdn.net/u012969412/article/details/88684723">·清尘·《FM、FMM、DeepFM整理（pytorch）》</a></li>
<li><a target="_blank" rel="noopener" href="https://blog.csdn.net/songbinxu/article/details/80151814">用Keras实现一个DeepFM</a></li>
</ul>
<hr>
<blockquote>
<p>作者：Jadepeng<br> 出处：jqpeng的技术记事本–<a target="_blank" rel="noopener" href="http://www.cnblogs.com/xiaoqi">http://www.cnblogs.com/xiaoqi</a><br> 您的支持是对博主最大的鼓励，感谢您的认真阅读。<br> 本文版权归作者所有，欢迎转载，但未经作者同意必须保留此段声明，且在文章页面明显位置给出原文连接，否则保留追究法律责任的权利。</p>
</blockquote>

      
    </div>

    
    
    
      <footer class="post-footer">
        <div class="post-eof"></div>
      </footer>
  </article>
  
  
  

      
  
  
  <article itemscope itemtype="http://schema.org/Article" class="post-block" lang="zh-CN">
    <link itemprop="mainEntityOfPage" href="http://blog.iflyresearch.com/2020/10/12/jqpeng-%E6%8E%A8%E8%8D%90%E7%AE%97%E6%B3%95%E4%B9%8B%EF%BC%9A%20LFM%20%E6%8E%A8%E8%8D%90%E7%AE%97%E6%B3%95/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="image" content="/jadepeng/images/avatar.gif">
      <meta itemprop="name" content="JadePeng">
      <meta itemprop="description" content="JadePeng的技术笔记本">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="JadePeng的技术笔记本">
    </span>
      <header class="post-header">
        <h2 class="post-title" itemprop="name headline">
          
            <a href="/jadepeng/2020/10/12/jqpeng-%E6%8E%A8%E8%8D%90%E7%AE%97%E6%B3%95%E4%B9%8B%EF%BC%9A%20LFM%20%E6%8E%A8%E8%8D%90%E7%AE%97%E6%B3%95/" class="post-title-link" itemprop="url">推荐算法之： LFM 推荐算法</a>
        </h2>

        <div class="post-meta">

         
            <span class="post-meta-item">
              <span class="post-meta-item-icon">
                <i class="far fa-calendar"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>

              <time title="创建时间：2020-10-12 21:10:00" itemprop="dateCreated datePublished" datetime="2020-10-12T21:10:00+08:00">2020-10-12</time>
            </span>
              <span class="post-meta-item">
                <span class="post-meta-item-icon">
                  <i class="far fa-calendar-check"></i>
                </span>
                <span class="post-meta-item-text">更新于</span>
                <time title="修改时间：2021-07-12 21:28:27" itemprop="dateModified" datetime="2021-07-12T21:28:27+08:00">2021-07-12</time>
              </span>
            <span class="post-meta-item">
              <span class="post-meta-item-icon">
                <i class="far fa-folder"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/jadepeng/categories/%E5%8D%9A%E5%AE%A2/" itemprop="url" rel="index"><span itemprop="name">博客</span></a>
                </span>
                  ，
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/jadepeng/categories/%E5%8D%9A%E5%AE%A2/jqpeng/" itemprop="url" rel="index"><span itemprop="name">jqpeng</span></a>
                </span>
            </span>

          <br>
            <span class="post-meta-item" title="本文字数">
              <span class="post-meta-item-icon">
                <i class="far fa-file-word"></i>
              </span>
                <span class="post-meta-item-text">本文字数：</span>
              <span>8k</span>
            </span>
            <span class="post-meta-item" title="阅读时长">
              <span class="post-meta-item-icon">
                <i class="far fa-clock"></i>
              </span>
                <span class="post-meta-item-text">阅读时长 &asymp;</span>
              <span>7 分钟</span>
            </span>

        </div>
      </header>

    
    
    
    <div class="post-body" itemprop="articleBody">

      
          <p>文章作者:jqpeng<br>原文链接: <a target="_blank" rel="noopener" href="https://www.cnblogs.com/xiaoqi/p/13805530.html">推荐算法之： LFM 推荐算法</a></p>
<h2 id="LFM介绍"><a href="#LFM介绍" class="headerlink" title="LFM介绍"></a>LFM介绍</h2><p>LFM(Funk SVD) 是利用 矩阵分解的推荐算法：</p>
<pre><code>R  = P * Q
</code></pre>
<p>其中：</p>
<ul>
<li>P矩阵是User-LF矩阵，即用户和隐含特征矩阵</li>
<li>Q矩阵是LF-Item矩阵，即隐含特征和物品的矩阵</li>
<li>R：R矩阵是User-Item矩阵，由P*Q得来</li>
</ul>
<p>见下图：</p>
<p><img src="https://gitee.com/jadepeng/pic/raw/master/pic/2020/10/12/1602505053626.png" alt="LFM"></p>
<p>R评分举证由于物品和用户数量巨大，且稀疏，因此利用矩阵乘法，转换为 P（n_user * dim) 和 Q （dim*n_count) 两个矩阵，dim 是隐含特征数量。</p>
<h2 id="Tensorflow实现"><a href="#Tensorflow实现" class="headerlink" title="Tensorflow实现"></a>Tensorflow实现</h2><p>下载<code>ml-100k</code> 数据集</p>
<pre><code>!wget http://files.grouplens.org/datasets/movielens/ml-100k.zip
!unzip ml-100k.zip



Resolving files.grouplens.org (files.grouplens.org)... 128.101.65.152
Connecting to files.grouplens.org (files.grouplens.org)|128.101.65.152|:80... connected.
HTTP request sent, awaiting response... 200 OK
Length: 4924029 (4.7M) [application/zip]
Saving to: ‘ml-100k.zip’

ml-100k.zip         100%[===================&gt;]   4.70M  16.2MB/s    in 0.3s    

2020-10-12 12:25:07 (16.2 MB/s) - ‘ml-100k.zip’ saved [4924029/4924029]

/bin/bash: uzip: command not found
</code></pre>
<p>评分数据在u.data里，分别是 user_id, movie_id, rating, timestamp</p>
<pre><code>!head ml-100k/u.data



186    302    3    891717742
22    377    1    878887116
244    51    2    880606923
166    346    1    886397596
298    474    4    884182806
115    265    2    881171488
253    465    5    891628467
305    451    3    886324817
6    86    3    883603013
</code></pre>
<p>读取数据</p>
<pre><code>import os
def read_data(path: str, separator: str):
    data = []
    with open(path, &#39;r&#39;) as f:
        for line in f.readlines():
            values = line.strip().split(separator)
            user_id, movie_id, rating, timestamp = int(values[0]), int(values[1]), int(values[2]), int(values[3])
            data.append((user_id, movie_id, rating, timestamp))
    return data

data = read_data(&#39;ml-100k/u.data&#39;, &#39;\t&#39;)

print(data[0])



(0, 0, 0.6)
</code></pre>
<p>拆分训练集和测试集，test_ratio比例为0.3：</p>
<pre><code>data = [(d[0], d[1], d[2]/5.0) for d in data]

# 拆分
test_ratio = 0.3
n_test = int(len(data) * test_ratio)
test_data, train_data = data[:n_test], data[n_test:]
</code></pre>
<p>id规整化，从0开始增长</p>
<pre><code>#id 规整
def normalize_id(data):
    new_data = []
    n_user, n_item = 0, 0
    user_id_old2new, item_id_old2new = &#123;&#125;, &#123;&#125;
    for user_id_old, item_id_old, label in data:
        if user_id_old not in user_id_old2new:
            user_id_old2new[user_id_old] = n_user
            n_user += 1
        if item_id_old not in item_id_old2new:
            item_id_old2new[item_id_old] = n_item
            n_item += 1
        new_data.append((user_id_old2new[user_id_old], item_id_old2new[item_id_old], label))
    return new_data, n_user, n_item, user_id_old2new, item_id_old2new

data, n_user, n_item, user_id_old2new, item_id_old2new = normalize_id(data)
</code></pre>
<p>查看数据</p>
<pre><code>print(train_data[0:10])
print(test_data[0])
print(&#39;n_user&#39;,n_user)
print(&#39;n_item&#39;,n_item)



(196, 242, 0.6)
n_user 943
n_item 1682
</code></pre>
<p>准备数据集</p>
<pre><code>import tensorflow as tf

def xy(data):
        user_ids = tf.constant([d[0] for d in data], dtype=tf.int32)
        item_ids = tf.constant([d[1] for d in data], dtype=tf.int32)
        labels = tf.constant([d[2] for d in data], dtype=tf.keras.backend.floatx())
        return &#123;&#39;user_id&#39;: user_ids, &#39;item_id&#39;: item_ids&#125;, labels

batch = 128
train_ds = tf.data.Dataset.from_tensor_slices(xy(train_data)).shuffle(len(train_data)).batch(batch)
test_ds = tf.data.Dataset.from_tensor_slices(xy(test_data)).batch(batch)
</code></pre>
<p>TF模型</p>
<pre><code>def LFM_model(n_user: int, n_item: int, dim=100, l2=1e-6) -&gt; tf.keras.Model:
    l2 = tf.keras.regularizers.l2(l2)
    user_id = tf.keras.Input(shape=(), name=&#39;user_id&#39;, dtype=tf.int32)

    user_embedding = tf.keras.layers.Embedding(n_user, dim, embeddings_regularizer=l2)(user_id)
    # (None,dim)
    item_id = tf.keras.Input(shape=(), name=&#39;item_id&#39;, dtype=tf.int32)
    item_embedding = tf.keras.layers.Embedding(n_item, dim, embeddings_regularizer=l2)(item_id)
    # (None,dim)
    r = user_embedding * item_embedding
    y = tf.reduce_sum(r, axis=1)
    y = tf.where(y &lt; 0., 0., y)
    y = tf.where(y &gt; 1., 1., y)
    y = tf.expand_dims(y, axis=1)
    return tf.keras.Model(inputs=[user_id, item_id], outputs=y)

model = LFM_model(n_user + 1, n_item + 1, 64)
</code></pre>
<p>编译模型</p>
<pre><code>model.compile(optimizer=&quot;adam&quot;, loss=tf.losses.MeanSquaredError(), metrics=[&#39;AUC&#39;, &#39;Precision&#39;, &#39;Recall&#39;])
model.summary()




__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
user_id (InputLayer)            [(None,)]            0                                            
__________________________________________________________________________________________________
item_id (InputLayer)            [(None,)]            0                                            
__________________________________________________________________________________________________
embedding_12 (Embedding)        (None, 64)           60416       user_id[0][0]                    
__________________________________________________________________________________________________
embedding_13 (Embedding)        (None, 64)           107712      item_id[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_Mul_6 (TensorFlowOp [(None, 64)]         0           embedding_12[0][0]               
                                                                 embedding_13[0][0]               
__________________________________________________________________________________________________
tf_op_layer_Sum_6 (TensorFlowOp [(None,)]            0           tf_op_layer_Mul_6[0][0]          
__________________________________________________________________________________________________
tf_op_layer_Less_6 (TensorFlowO [(None,)]            0           tf_op_layer_Sum_6[0][0]          
__________________________________________________________________________________________________
tf_op_layer_SelectV2_12 (Tensor [(None,)]            0           tf_op_layer_Less_6[0][0]         
                                                                 tf_op_layer_Sum_6[0][0]          
__________________________________________________________________________________________________
tf_op_layer_Greater_6 (TensorFl [(None,)]            0           tf_op_layer_SelectV2_12[0][0]    
__________________________________________________________________________________________________
tf_op_layer_SelectV2_13 (Tensor [(None,)]            0           tf_op_layer_Greater_6[0][0]      
                                                                 tf_op_layer_SelectV2_12[0][0]    
__________________________________________________________________________________________________
tf_op_layer_ExpandDims_6 (Tenso [(None, 1)]          0           tf_op_layer_SelectV2_13[0][0]    
==================================================================================================
Total params: 168,128
Trainable params: 168,128
Non-trainable params: 0
__________________________________________________________________________________________________
</code></pre>
<p>下面开始训练10次epochs</p>
<pre><code>model.fit(train_ds,validation_data=test_ds,epochs=10)



Epoch 1/10

/usr/local/lib/python3.6/dist-packages/tensorflow/python/framework/indexed_slices.py:432: UserWarning: Converting sparse IndexedSlices to a dense Tensor of unknown shape. This may consume a large amount of memory.
  &quot;Converting sparse IndexedSlices to a dense Tensor of unknown shape. &quot;
547/547 [==============================] - 2s 4ms/step - loss: 0.4388 - auc: 0.0000e+00 - precision: 1.0000 - recall: 0.0594 - val_loss: 0.1439 - val_auc: 0.0000e+00 - val_precision: 1.0000 - val_recall: 0.4180
Epoch 2/10
547/547 [==============================] - 2s 4ms/step - loss: 0.0585 - auc: 0.0000e+00 - precision: 1.0000 - recall: 0.8171 - val_loss: 0.0486 - val_auc: 0.0000e+00 - val_precision: 1.0000 - val_recall: 0.8655
Epoch 3/10
547/547 [==============================] - 2s 3ms/step - loss: 0.0393 - auc: 0.0000e+00 - precision: 1.0000 - recall: 0.9053 - val_loss: 0.0433 - val_auc: 0.0000e+00 - val_precision: 1.0000 - val_recall: 0.8982
Epoch 4/10
547/547 [==============================] - 2s 3ms/step - loss: 0.0346 - auc: 0.0000e+00 - precision: 1.0000 - recall: 0.9107 - val_loss: 0.0415 - val_auc: 0.0000e+00 - val_precision: 1.0000 - val_recall: 0.8947
Epoch 5/10
547/547 [==============================] - 2s 4ms/step - loss: 0.0301 - auc: 0.0000e+00 - precision: 1.0000 - recall: 0.9071 - val_loss: 0.0410 - val_auc: 0.0000e+00 - val_precision: 1.0000 - val_recall: 0.8869
Epoch 6/10
547/547 [==============================] - 2s 4ms/step - loss: 0.0257 - auc: 0.0000e+00 - precision: 1.0000 - recall: 0.8958 - val_loss: 0.0410 - val_auc: 0.0000e+00 - val_precision: 1.0000 - val_recall: 0.8849
Epoch 7/10
547/547 [==============================] - 2s 4ms/step - loss: 0.0218 - auc: 0.0000e+00 - precision: 1.0000 - recall: 0.8844 - val_loss: 0.0414 - val_auc: 0.0000e+00 - val_precision: 1.0000 - val_recall: 0.8753
Epoch 8/10
547/547 [==============================] - 2s 4ms/step - loss: 0.0183 - auc: 0.0000e+00 - precision: 1.0000 - recall: 0.8719 - val_loss: 0.0425 - val_auc: 0.0000e+00 - val_precision: 1.0000 - val_recall: 0.8659
Epoch 9/10
547/547 [==============================] - 2s 4ms/step - loss: 0.0153 - auc: 0.0000e+00 - precision: 1.0000 - recall: 0.8624 - val_loss: 0.0435 - val_auc: 0.0000e+00 - val_precision: 1.0000 - val_recall: 0.8620
Epoch 10/10
547/547 [==============================] - 2s 4ms/step - loss: 0.0132 - auc: 0.0000e+00 - precision: 1.0000 - recall: 0.8535 - val_loss: 0.0449 - val_auc: 0.0000e+00 - val_precision: 1.0000 - val_recall: 0.8531
</code></pre>
<hr>
<blockquote>
<p>作者：Jadepeng<br> 出处：jqpeng的技术记事本–<a target="_blank" rel="noopener" href="http://www.cnblogs.com/xiaoqi">http://www.cnblogs.com/xiaoqi</a><br> 您的支持是对博主最大的鼓励，感谢您的认真阅读。<br> 本文版权归作者所有，欢迎转载，但未经作者同意必须保留此段声明，且在文章页面明显位置给出原文连接，否则保留追究法律责任的权利。</p>
</blockquote>

      
    </div>

    
    
    
      <footer class="post-footer">
        <div class="post-eof"></div>
      </footer>
  </article>
  
  
  

      
  
  
  <article itemscope itemtype="http://schema.org/Article" class="post-block" lang="zh-CN">
    <link itemprop="mainEntityOfPage" href="http://blog.iflyresearch.com/2020/10/11/jqpeng-docker%20%E7%94%B1%E4%BA%8Eiptables%E5%AF%BC%E8%87%B4%E6%97%A0%E6%B3%95%E6%AD%A3%E5%B8%B8%E5%90%AF%E5%8A%A8%E9%97%AE%E9%A2%98%E4%B8%B4%E6%97%B6%E8%A7%A3%E5%86%B3%E6%96%B9%E6%A1%88/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="image" content="/jadepeng/images/avatar.gif">
      <meta itemprop="name" content="JadePeng">
      <meta itemprop="description" content="JadePeng的技术笔记本">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="JadePeng的技术笔记本">
    </span>
      <header class="post-header">
        <h2 class="post-title" itemprop="name headline">
          
            <a href="/jadepeng/2020/10/11/jqpeng-docker%20%E7%94%B1%E4%BA%8Eiptables%E5%AF%BC%E8%87%B4%E6%97%A0%E6%B3%95%E6%AD%A3%E5%B8%B8%E5%90%AF%E5%8A%A8%E9%97%AE%E9%A2%98%E4%B8%B4%E6%97%B6%E8%A7%A3%E5%86%B3%E6%96%B9%E6%A1%88/" class="post-title-link" itemprop="url">docker 由于iptables导致无法正常启动问题临时解决方案</a>
        </h2>

        <div class="post-meta">

         
            <span class="post-meta-item">
              <span class="post-meta-item-icon">
                <i class="far fa-calendar"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>

              <time title="创建时间：2020-10-12 00:01:00" itemprop="dateCreated datePublished" datetime="2020-10-12T00:01:00+08:00">2020-10-12</time>
            </span>
              <span class="post-meta-item">
                <span class="post-meta-item-icon">
                  <i class="far fa-calendar-check"></i>
                </span>
                <span class="post-meta-item-text">更新于</span>
                <time title="修改时间：2021-07-12 21:28:27" itemprop="dateModified" datetime="2021-07-12T21:28:27+08:00">2021-07-12</time>
              </span>
            <span class="post-meta-item">
              <span class="post-meta-item-icon">
                <i class="far fa-folder"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/jadepeng/categories/%E5%8D%9A%E5%AE%A2/" itemprop="url" rel="index"><span itemprop="name">博客</span></a>
                </span>
                  ，
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/jadepeng/categories/%E5%8D%9A%E5%AE%A2/jqpeng/" itemprop="url" rel="index"><span itemprop="name">jqpeng</span></a>
                </span>
            </span>

          <br>
            <span class="post-meta-item" title="本文字数">
              <span class="post-meta-item-icon">
                <i class="far fa-file-word"></i>
              </span>
                <span class="post-meta-item-text">本文字数：</span>
              <span>310</span>
            </span>
            <span class="post-meta-item" title="阅读时长">
              <span class="post-meta-item-icon">
                <i class="far fa-clock"></i>
              </span>
                <span class="post-meta-item-text">阅读时长 &asymp;</span>
              <span>1 分钟</span>
            </span>

        </div>
      </header>

    
    
    
    <div class="post-body" itemprop="articleBody">

      
          <p>文章作者:jqpeng<br>原文链接: <a target="_blank" rel="noopener" href="https://www.cnblogs.com/xiaoqi/p/13800447.html">docker 由于iptables导致无法正常启动问题临时解决方案</a></p>
<p>docker安装新的ca证书后无法正常启动，<br> 表现为<code>/sbin/iptables --wait -t filter -N DOCKER-ISOLATION-STAGE-2</code> hang住，<br> 日志有报错 <code>xtables contention detected while running ..</code></p>
<p>解决历程：</p>
<ol>
<li>重启大法，先stop再start无果</li>
<li>iptables 重装大法，无果</li>
<li>docker升级到最新版本无果</li>
<li>确定还是iptables的问题，暂时没时间详细排查，于是docker禁用iptables，先卸载iptables，docker启动设置iptables false</li>
</ol>

      
    </div>

    
    
    
      <footer class="post-footer">
        <div class="post-eof"></div>
      </footer>
  </article>
  
  
  

      
  
  
  <article itemscope itemtype="http://schema.org/Article" class="post-block" lang="zh-CN">
    <link itemprop="mainEntityOfPage" href="http://blog.iflyresearch.com/2020/09/29/jqpeng-%E9%98%BF%E9%87%8C%E5%BC%80%E6%BA%90JDK%20dragonwell8%E5%9C%A8%E5%AE%B9%E5%99%A8%E7%8E%AF%E5%A2%83%E4%BD%BF%E7%94%A8/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="image" content="/jadepeng/images/avatar.gif">
      <meta itemprop="name" content="JadePeng">
      <meta itemprop="description" content="JadePeng的技术笔记本">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="JadePeng的技术笔记本">
    </span>
      <header class="post-header">
        <h2 class="post-title" itemprop="name headline">
          
            <a href="/jadepeng/2020/09/29/jqpeng-%E9%98%BF%E9%87%8C%E5%BC%80%E6%BA%90JDK%20dragonwell8%E5%9C%A8%E5%AE%B9%E5%99%A8%E7%8E%AF%E5%A2%83%E4%BD%BF%E7%94%A8/" class="post-title-link" itemprop="url">阿里开源JDK dragonwell8在容器环境使用</a>
        </h2>

        <div class="post-meta">

         
            <span class="post-meta-item">
              <span class="post-meta-item-icon">
                <i class="far fa-calendar"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>

              <time title="创建时间：2020-09-29 15:30:00" itemprop="dateCreated datePublished" datetime="2020-09-29T15:30:00+08:00">2020-09-29</time>
            </span>
              <span class="post-meta-item">
                <span class="post-meta-item-icon">
                  <i class="far fa-calendar-check"></i>
                </span>
                <span class="post-meta-item-text">更新于</span>
                <time title="修改时间：2021-07-12 21:28:27" itemprop="dateModified" datetime="2021-07-12T21:28:27+08:00">2021-07-12</time>
              </span>
            <span class="post-meta-item">
              <span class="post-meta-item-icon">
                <i class="far fa-folder"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/jadepeng/categories/%E5%8D%9A%E5%AE%A2/" itemprop="url" rel="index"><span itemprop="name">博客</span></a>
                </span>
                  ，
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/jadepeng/categories/%E5%8D%9A%E5%AE%A2/jqpeng/" itemprop="url" rel="index"><span itemprop="name">jqpeng</span></a>
                </span>
            </span>

          <br>
            <span class="post-meta-item" title="本文字数">
              <span class="post-meta-item-icon">
                <i class="far fa-file-word"></i>
              </span>
                <span class="post-meta-item-text">本文字数：</span>
              <span>3.3k</span>
            </span>
            <span class="post-meta-item" title="阅读时长">
              <span class="post-meta-item-icon">
                <i class="far fa-clock"></i>
              </span>
                <span class="post-meta-item-text">阅读时长 &asymp;</span>
              <span>3 分钟</span>
            </span>

        </div>
      </header>

    
    
    
    <div class="post-body" itemprop="articleBody">

      
          <p>文章作者:jqpeng<br>原文链接: <a target="_blank" rel="noopener" href="https://www.cnblogs.com/xiaoqi/p/dragonwell8-docker.html">阿里开源JDK dragonwell8在容器环境使用</a></p>
<p>Alibaba Dragonwell 是阿里巴巴的Open JDK 发行版，提供长期支持。 阿里宣传称在阿里生产环境实现了应用。Alibaba Dragonwell兼容 Java SE 标准，因此可以方便切换。</p>
<h2 id="下载"><a href="#下载" class="headerlink" title="下载"></a>下载</h2><p>可以到<a target="_blank" rel="noopener" href="https://github.com/alibaba/dragonwell8/releases?spm=5176.cndragonwell.0.0.4c5a7568DpYPsp">https://github.com/alibaba/dragonwell8/releases?spm=5176.cndragonwell.0.0.4c5a7568DpYPsp</a> 下载，当前的最新版是8.4.4 GA</p>
<p><img src="https://gitee.com/jadepeng/pic/raw/master/pic/2020/9/29/1601363568094.png" alt="ali jdk8"></p>
<p>阿里也提供了镜像下载地址，可以加速下载：</p>
<blockquote>
<p>8.4.4GA</p>
</blockquote>
<table>
<thead>
<tr>
<th>File name</th>
<th>中国大陆</th>
<th>United States</th>
</tr>
</thead>
<tbody><tr>
<td>Alibaba_Dragonwell_8.4.4-GA_Linux_x64.tar.gz</td>
<td><a target="_blank" rel="noopener" href="https://dragonwell.oss-cn-shanghai.aliyuncs.com/8/8.4.4-GA/Alibaba_Dragonwell_8.4.4-GA_Linux_x64.tar.gz">download</a></td>
<td><a target="_blank" rel="noopener" href="https://github.com/alibaba/dragonwell8/releases/download/dragonwell-8.4.4_jdk8u262-ga/Alibaba_Dragonwell_8.4.4-GA_Linux_x64.tar.gz">download</a></td>
</tr>
<tr>
<td>Alibaba_Dragonwell_8.4.4-GA_source.tar.gz</td>
<td><a target="_blank" rel="noopener" href="https://dragonwell.oss-cn-shanghai.aliyuncs.com/8/8.4.4-GA/Alibaba_Dragonwell_8.4.4-GA_source.tar.gz">download</a></td>
<td><a target="_blank" rel="noopener" href="https://github.com/alibaba/dragonwell8/releases/download/dragonwell-8.4.4_jdk8u262-ga/Alibaba_Dragonwell_8.4.4-GA_source.tar.gz">download</a></td>
</tr>
<tr>
<td>Alibaba_Dragonwell_8.4.4-Experimental_Windows_x64.tar.gz</td>
<td><a target="_blank" rel="noopener" href="https://dragonwell.oss-cn-shanghai.aliyuncs.com/8/8.4.4-GA/Alibaba_Dragonwell_8.4.4-Experimental_Windows_x64.tar.gz">download</a></td>
<td><a target="_blank" rel="noopener" href="https://github.com/alibaba/dragonwell8/releases/download/dragonwell-8.4.4_jdk8u262-ga/Alibaba_Dragonwell_8.4.4-Experimental_Windows_x64.tar.gz">download</a></td>
</tr>
<tr>
<td>java8-api-8.4.4-javadoc.jar</td>
<td><a target="_blank" rel="noopener" href="https://dragonwell.oss-cn-shanghai.aliyuncs.com/8/8.4.4-GA/java8-api-8.4.4-javadoc.jar">download</a></td>
<td><a target="_blank" rel="noopener" href="https://github.com/alibaba/dragonwell8/releases/download/dragonwell-8.4.4_jdk8u262-ga/java8-api-8.4.4-javadoc.jar">download</a></td>
</tr>
<tr>
<td>java8-api-8.4.4-sources.jar</td>
<td><a target="_blank" rel="noopener" href="https://dragonwell.oss-cn-shanghai.aliyuncs.com/8/8.4.4-GA/java8-api-8.4.4-sources.jar">download</a></td>
<td><a target="_blank" rel="noopener" href="https://github.com/alibaba/dragonwell8/releases/download/dragonwell-8.4.4_jdk8u262-ga/java8-api-8.4.4-sources.jar">download</a></td>
</tr>
<tr>
<td>java8-api-8.4.4.jar</td>
<td><a target="_blank" rel="noopener" href="https://dragonwell.oss-cn-shanghai.aliyuncs.com/8/8.4.4-GA/java8-api-8.4.4.jar">download</a></td>
<td><a target="_blank" rel="noopener" href="https://github.com/alibaba/dragonwell8/releases/download/dragonwell-8.4.4_jdk8u262-ga/java8-api-8.4.4.jar">download</a></td>
</tr>
</tbody></table>
<blockquote>
<p><a target="_blank" rel="noopener" href="https://github.com/alibaba/dragonwell8/releases/tag/dragonwell-8.4.4_jdk8u262-ga">SHA256 checksum</a></p>
</blockquote>
<h2 id="使用"><a href="#使用" class="headerlink" title="使用"></a>使用</h2><pre><code>wget https://dragonwell.oss-cn-shanghai.aliyuncs.com/8/8.4.4-GA/Alibaba_Dragonwell_8.4.4-GA_Linux_x64.tar.gz
tar zxvf Alibaba_Dragonwell_8.4.4-GA_Linux_x64.tar.gz 
cd jdk8u262-b10/
 bin/java -version
</code></pre>
<p>输出：</p>
<pre><code>openjdk version &quot;1.8.0_262&quot;
OpenJDK Runtime Environment (Alibaba Dragonwell 8.4.4) (build 1.8.0_262-b10)
OpenJDK 64-Bit Server VM (Alibaba Dragonwell 8.4.4) (build 25.262-b10, mixed mode)
</code></pre>
<h2 id="容器环境使用"><a href="#容器环境使用" class="headerlink" title="容器环境使用"></a>容器环境使用</h2><p>我们需要准备一个基础镜像包，我们以openjdk:8-jdk-slim为基础包，把jdk替换为dragonwell8</p>
<pre><code> FROM openjdk:8-jdk-slim
 MAINTAINER jadepeng
 
 RUN sed -i &#39;s#http://deb.debian.org#https://mirrors.163.com#g&#39; /etc/apt/sources.list \
     &amp;&amp; apt-get update\
     &amp;&amp; apt-get install -y procps unzip curl bash tzdata ttf-dejavu \
     &amp;&amp; rm -rf /var/cache/apt/ \
     &amp;&amp; ln -sf /usr/share/zoneinfo/Asia/Shanghai /etc/localtime \
     &amp;&amp; echo &quot;Asia/Shanghai&quot; &gt; /etc/timezone
 
 RUN rm -r -f /usr/local/openjdk-8
 
 ADD jdk8u262-b10  /usr/local/openjdk-8
</code></pre>
<p>构建：</p>
<pre><code>docker build -t dragonwell8:8.4.4 .
</code></pre>
<p>java应用就可以用<code>dragonwell8:8.4.4 </code>为底包执行了。</p>
<h2 id="dragonwell8-协程使用"><a href="#dragonwell8-协程使用" class="headerlink" title="dragonwell8 协程使用"></a>dragonwell8 协程使用</h2><p>dragonwell8的一大特色就是协程（Coroutine ）</p>
<p>官方有一个demo：</p>
<p>以一个pingpong 1,000,000次的程序为例，这是一个需要阻塞，切换密集型的应用。</p>
<pre><code>           o      .   _______ _______
              \_ 0     /______//______/|   @_o
                /\_,  /______//______/     /\
               | \    |      ||      |     / |

static final ExecutorService THREAD_POOL = Executors.newCachedThreadPool();

public static void main(String[] args) throws Exception &#123;
    BlockingQueue&lt;Byte&gt; q1 = new LinkedBlockingQueue&lt;&gt;(), q2 = new LinkedBlockingQueue&lt;&gt;();
    THREAD_POOL.submit(() -&gt; pingpong(q2, q1)); // thread A
    Future&lt;?&gt; f = THREAD_POOL.submit(() -&gt; pingpong(q1, q2)); // thread B
    q1.put((byte) 1);
    System.out.println(f.get() + &quot; ms&quot;);
&#125;

private static long pingpong(BlockingQueue&lt;Byte&gt; in, BlockingQueue&lt;Byte&gt; out) throws Exception &#123;
    long start = System.currentTimeMillis();
    for (int i = 0; i &lt; 1_000_000; i++) out.put(in.take());
    return System.currentTimeMillis() - start;
&#125;
</code></pre>
<p>运行，查看执行时间:</p>
<pre><code>$java PingPong
13212 ms

// 开启Wisp2
$java -XX:+UseWisp2 -XX:ActiveProcessorCount=1 PingPong
882 ms
</code></pre>
<p>开启Wisp2后整体运行效率提升了近十多倍，只需要启动时增加参数<code>-XX:+UseWisp2</code>即可。不用修改一行代码，即可享受协程带来的优势。</p>
<p>随后可以通过jstack观察到起来的线程都以协程的方式在运行了。</p>
<pre><code> - Coroutine [0x7f6d6d60fb20] &quot;Thread-978&quot; #1076 active=1 steal=0 steal_fail=0 preempt=0 park=0/-1
        at java.dyn.CoroutineSupport.unsafeSymmetricYieldTo(CoroutineSupport.java:138)
--
 - Coroutine [0x7f6d6d60f880] &quot;Thread-912&quot; #1009 active=1 steal=0 steal_fail=0 preempt=0 park=0/-1
        at java.dyn.CoroutineSupport.unsafeSymmetricYieldTo(CoroutineSupport.java:138)

...
</code></pre>
<p>可以看到最上方的frame上的方法是协程切换，因为线程调用了sleep，yield出了执行权。</p>
<p>开启Wisp2后，Java线程不再简单地映射到内核级线程，而是对应到一个协程，JVM在少量内核线上调度大量协程执行，以减少内核的调度开销，提高web服务器的性能。</p>
<p>在阿里的生产环境，性能指标：</p>
<ul>
<li>在复杂的业务应用中(tomcat + 大量基于netty的中间件)我们获得了大约10%的性能提升。</li>
<li>在中间件应用(数据库代理，MQ)中我们获得大约20%的性能提升。</li>
</ul>
<p>更多Wisp的设计实现与API相关信息，请参考<a target="_blank" rel="noopener" href="https://github.com/alibaba/dragonwell8/wiki/Wisp%E6%96%87%E6%A1%A3">Wisp文档</a>。</p>
<hr>
<blockquote>
<p>作者：Jadepeng<br> 出处：jqpeng的技术记事本–<a target="_blank" rel="noopener" href="http://www.cnblogs.com/xiaoqi">http://www.cnblogs.com/xiaoqi</a><br> 您的支持是对博主最大的鼓励，感谢您的认真阅读。<br> 本文版权归作者所有，欢迎转载，但未经作者同意必须保留此段声明，且在文章页面明显位置给出原文连接，否则保留追究法律责任的权利。</p>
</blockquote>

      
    </div>

    
    
    
      <footer class="post-footer">
        <div class="post-eof"></div>
      </footer>
  </article>
  
  
  

      
  
  
  <article itemscope itemtype="http://schema.org/Article" class="post-block" lang="zh-CN">
    <link itemprop="mainEntityOfPage" href="http://blog.iflyresearch.com/2020/08/31/jqpeng-%E6%9D%A5%EF%BC%8C%E6%88%91%E4%BB%AC%E4%B8%80%E8%B5%B7%E6%89%93%E9%80%A0%E4%B8%80%E6%AC%BE%E4%BB%A3%E7%A0%81%E5%91%BD%E5%90%8D%E5%B7%A5%E5%85%B7/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="image" content="/jadepeng/images/avatar.gif">
      <meta itemprop="name" content="JadePeng">
      <meta itemprop="description" content="JadePeng的技术笔记本">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="JadePeng的技术笔记本">
    </span>
      <header class="post-header">
        <h2 class="post-title" itemprop="name headline">
          
            <a href="/jadepeng/2020/08/31/jqpeng-%E6%9D%A5%EF%BC%8C%E6%88%91%E4%BB%AC%E4%B8%80%E8%B5%B7%E6%89%93%E9%80%A0%E4%B8%80%E6%AC%BE%E4%BB%A3%E7%A0%81%E5%91%BD%E5%90%8D%E5%B7%A5%E5%85%B7/" class="post-title-link" itemprop="url">来，我们一起打造一款代码命名工具</a>
        </h2>

        <div class="post-meta">

         
            <span class="post-meta-item">
              <span class="post-meta-item-icon">
                <i class="far fa-calendar"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>

              <time title="创建时间：2020-08-31 20:34:00" itemprop="dateCreated datePublished" datetime="2020-08-31T20:34:00+08:00">2020-08-31</time>
            </span>
              <span class="post-meta-item">
                <span class="post-meta-item-icon">
                  <i class="far fa-calendar-check"></i>
                </span>
                <span class="post-meta-item-text">更新于</span>
                <time title="修改时间：2021-07-12 21:28:27" itemprop="dateModified" datetime="2021-07-12T21:28:27+08:00">2021-07-12</time>
              </span>
            <span class="post-meta-item">
              <span class="post-meta-item-icon">
                <i class="far fa-folder"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/jadepeng/categories/%E5%8D%9A%E5%AE%A2/" itemprop="url" rel="index"><span itemprop="name">博客</span></a>
                </span>
                  ，
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/jadepeng/categories/%E5%8D%9A%E5%AE%A2/jqpeng/" itemprop="url" rel="index"><span itemprop="name">jqpeng</span></a>
                </span>
            </span>

          <br>
            <span class="post-meta-item" title="本文字数">
              <span class="post-meta-item-icon">
                <i class="far fa-file-word"></i>
              </span>
                <span class="post-meta-item-text">本文字数：</span>
              <span>4.6k</span>
            </span>
            <span class="post-meta-item" title="阅读时长">
              <span class="post-meta-item-icon">
                <i class="far fa-clock"></i>
              </span>
                <span class="post-meta-item-text">阅读时长 &asymp;</span>
              <span>4 分钟</span>
            </span>

        </div>
      </header>

    
    
    
    <div class="post-body" itemprop="articleBody">

      
          <p>文章作者:jqpeng<br>原文链接: <a target="_blank" rel="noopener" href="https://www.cnblogs.com/xiaoqi/p/code-naming-tool.html">来，我们一起打造一款代码命名工具</a></p>
<p>你是否还在为代码命名而纠结不已？</p>
<blockquote>
<p>here are only two hard things in Computer Science: cache invalidation and naming things.– Phil Karlton</p>
</blockquote>
<p><img src="https://gitee.com/jadepeng/pic/raw/master/pic/2020/8/31/1598875275591.png" alt="代码命名"></p>
<p>那么如何更好的命名呢？ 是否有好的工具可以支持我们命名呢？网上搜索一圈没有发现满意的，于是自己动手丰衣足食，<a target="_blank" rel="noopener" href="https://jadepeng.gitee.io/code-naming-tool/">https://jadepeng.gitee.io/code-naming-tool/</a>。</p>
<p>使用方法： 打开网页后，在中文输入框中输入 中文命名，然后回车即可。也可以直接在英文输入框输入英文，搜索候选。</p>
<h2 id="现有的工具"><a href="#现有的工具" class="headerlink" title="现有的工具"></a>现有的工具</h2><p>unbug.github.io/codelf/ 提供了一个选择，作者先调用有道、百度等翻译，然后调用searchcode搜索代码，从搜索的代码中提取变量名。</p>
<p><img src="https://gitee.com/jadepeng/pic/raw/master/pic/2020/8/31/1598875386957.png" alt="codeif"></p>
<p>界面做的很酷，但是推荐出来的变量名称质量参差不齐，失去了参考意义。</p>
<h2 id="新的思路"><a href="#新的思路" class="headerlink" title="新的思路"></a>新的思路</h2><p>我们常说以史为鉴，换一个思路，我们可以从优秀的开源库中去吸收他们命名的经验，看看他们是如何命名的，来供我们参考。</p>
<p>实现思路：  </p>
<ol>
<li>从spring、apache等代码库，读取变量、方法、类名称  </li>
<li>根据关键词匹配出候选命名  </li>
<li>候选结果排序</li>
</ol>
<p><img src="https://gitee.com/jadepeng/pic/raw/master/pic/2020/8/31/1598875225454.png" alt="工具"></p>
<h2 id="获取优秀命名"><a href="#获取优秀命名" class="headerlink" title="获取优秀命名"></a>获取优秀命名</h2><p>要获取命名，首先想到的是读取代码库，需要先下载代码，然后解析  ———— 工作量巨大，PASS。</p>
<p>那怎么做呢，换个角度，可以通过java的反射来实现。</p>
<p>首先添加一个辅助库：</p>
<pre><code>&lt;dependency&gt;
            &lt;groupId&gt;org.reflections&lt;/groupId&gt;
            &lt;artifactId&gt;reflections&lt;/artifactId&gt;
            &lt;version&gt;0.9.12&lt;/version&gt;
        &lt;/dependency&gt;
</code></pre>
<p>然后初始化Reflections,FilterBuilder可以用来过滤类库，我们设置”org”,”javax”,”com”,”io”, 基本上囊库了主要的开源类库，比如spring，apache等.</p>
<pre><code> List&lt;ClassLoader&gt; classLoadersList = new LinkedList&lt;ClassLoader&gt;();
        classLoadersList.add(ClasspathHelper.contextClassLoader());
        classLoadersList.add(ClasspathHelper.staticClassLoader());

        Reflections reflections = new Reflections(new ConfigurationBuilder()
                .setScanners(new SubTypesScanner(false), new ResourcesScanner())
                .setUrls(ClasspathHelper.forClassLoader(classLoadersList.toArray(new ClassLoader[0])))
                .filterInputsBy(new FilterBuilder().includePackage(&quot;org&quot;,&quot;javax&quot;,&quot;com&quot;,&quot;io&quot;)));
</code></pre>
<p>然后，可以通过<code>reflections.getSubTypesOf(Object.class);</code>来获取相关的class了,注意，我们初始化一个<code> Map&lt;String, Integer&gt; name2count = new HashMap&lt;String, Integer&gt;();</code>用来存储代码命名以及对应的出现次数。</p>
<pre><code>Set&lt;Class&lt;? extends Object&gt;&gt; allClasses =
                reflections.getSubTypesOf(Object.class);
        Map&lt;String, Integer&gt; name2count = new HashMap&lt;String, Integer&gt;();
        for (Class&lt;?&gt; clazz : allClasses) &#123;
            System.out.println(clazz.getName());
            try &#123;
                appendToNameMap(name2count, clazz.getSimpleName());

                Field[] fields = clazz.getDeclaredFields();
                for (Field field : fields) &#123;
                    String name = field.getName();
                    appendToNameMap(name2count, name);
                &#125;
                Method[] methods = clazz.getMethods();
                for (Method method : methods) &#123;
                    String name = method.getName();
                    appendToNameMap(name2count, name);
                    // parameters
                    Parameter[] parameters =  method.getParameters();
                    for (Parameter param : parameters) &#123;
                        name = param.getName();
                        appendToNameMap(name2count, name);
                    &#125;
                &#125;
            &#125;catch(Throwable t)
            &#123; &#125;
</code></pre>
<p>其中<code>appendToNameMap</code>:</p>
<pre><code> private static void appendToNameMap(Map&lt;String, Integer&gt; name2count, String name) &#123;
        // filter
        if(name.contains(&quot;-&quot;) || name.contains(&quot;_&quot;)|| name.contains(&quot;$&quot;))&#123;
            return;
        &#125;

        if (!name2count.containsKey(name)) &#123;
            name2count.put(name, 1);
        &#125; else &#123;
            name2count.put(name, name2count.get(name) +1);
        &#125;
    &#125;
</code></pre>
<p>最后把结果存储到文件，作为我们的资源。</p>
<pre><code>FileUtils.writeAllText(JSON.toJSONString(name2count), new File(&quot;name2count.txt&quot;));
</code></pre>
<p>可以到<code>https://gitee.com/jadepeng/code-naming-tool/blob/master/vars.js</code>查看结果。</p>
<h2 id="命名推荐"><a href="#命名推荐" class="headerlink" title="命名推荐"></a>命名推荐</h2><p>命名推荐，还是遵循，先翻译，然后根据翻译结果搜索并召回。</p>
<p>其中翻译直接调用网易有道的，但是搜索如何搞定呢？</p>
<p>最简单的方法，肯定是分词，然后建立索引，lucene是标配。但是上lucene就要上服务器，PASS!</p>
<p>我们来找一个浏览器端的lucene，google 后选定<code>flexsearch</code>.</p>
<p><img src="https://gitee.com/jadepeng/pic/raw/master/pic/2020/8/31/1598876259412.png" alt="flexsearch"></p>
<p>flexsearch github上有6.5k star，因此优先选择。</p>
<p>下面来看具体的实现。</p>
<h3 id="建立索引"><a href="#建立索引" class="headerlink" title="建立索引"></a>建立索引</h3><p>初始化FlexSearch，然后将之前获取的代码命名建立索引。</p>
<pre><code> var index = new FlexSearch(&#123;
            encode: &quot;advanced&quot;,
            tokenize: &quot;reverse&quot;,
            suggest: true,
            cache: true
        &#125;)
        var data = []
        var i = 0
        for (var name in names) &#123;
            var indexName = name.replace(/([A-Z])/g, &quot; $1&quot;)
            data[i] = &#123;
                &quot;name&quot;: name,
                &quot;count&quot;: names[name]
            &#125;
            index.add(i++, indexName)
        &#125;
</code></pre>
<p>这里有个小技巧，<code>name.replace(/([A-Z])/g, &quot; $1&quot;)</code> 可以将驼峰命名拆分成单词。<br> 同时data数组会保存所有的命名和响应的出现次数。</p>
<h3 id="搜索候选"><a href="#搜索候选" class="headerlink" title="搜索候选"></a>搜索候选</h3><p>先翻译，然后将翻译结果给FlexSearch搜索。</p>
<pre><code>function searchFromIndex(value) &#123;
        var results = index.search(value, 25)
    
        results = results.map(function (i) &#123;
            return data[i]
        &#125;)
    
        results = results.sort(function (a, b) &#123;
            return b.count - a.count
        &#125;)
        return results
    &#125;
</code></pre>
<p>先搜索，出来的结果是data中的index序号，转换为list对象，然后按照count倒排。</p>
<p>tips： 理论上，翻译的结果可以去除一些停用词，搜索效果应该更好，这里先放着。</p>
<h3 id="显示结果"><a href="#显示结果" class="headerlink" title="显示结果"></a>显示结果</h3><p>对结果进行格式化：</p>
<pre><code>function formatSuggestion(item)&#123;
    return `$&#123;item.name&#125; &lt;span class=&#39;tips&#39;&gt;代码库共出现$&#123;item.count&#125;次 (相关搜索： &lt;a target=&#39;_blank&#39; href=&#39;https://unbug.github.io/codelf/#$&#123;item.name&#125;&#39;&gt;codelf&lt;/a&gt; &amp;nbsp; &lt;a target=&#39;_blank&#39; href=&#39;https://searchcode.com/?q=$&#123;item.name&#125;&amp;lan=23&#39;&gt;searchcode&lt;/a&gt;)&lt;/span&gt;`;
&#125;
</code></pre>
<p>增加到codelf 和 searchcode的链接，显示结果如下：</p>
<p><img src="https://gitee.com/jadepeng/pic/raw/master/pic/2020/8/31/1598877282579.png" alt="搜索结果"></p>
<h2 id="开源地址"><a href="#开源地址" class="headerlink" title="开源地址"></a>开源地址</h2><ul>
<li>github:  <a target="_blank" rel="noopener" href="https://github.com/jadepeng/code-naming-tool">https://github.com/jadepeng/code-naming-tool</a></li>
<li>gitee:  <a target="_blank" rel="noopener" href="https://gitee.com/jadepeng/code-naming-tool">https://gitee.com/jadepeng/code-naming-tool</a></li>
</ul>
<p>命名工具地址： <a target="_blank" rel="noopener" href="https://jadepeng.gitee.io/code-naming-tool/">https://jadepeng.gitee.io/code-naming-tool/</a></p>
<p>欢迎大家体验使用，欢迎fork并贡献代码。</p>
<h2 id="后续展望"><a href="#后续展望" class="headerlink" title="后续展望"></a>后续展望</h2><p>当前仅仅用到了翻译+搜索，还有很多可以优化的地方：</p>
<ul>
<li>搜索去停用词</li>
<li>从文本语义相似度层面去推荐</li>
<li>专业术语支持</li>
</ul>
<hr>
<blockquote>
<p>作者：Jadepeng<br> 出处：jqpeng的技术记事本–<a target="_blank" rel="noopener" href="http://www.cnblogs.com/xiaoqi">http://www.cnblogs.com/xiaoqi</a><br> 您的支持是对博主最大的鼓励，感谢您的认真阅读。<br> 本文版权归作者所有，欢迎转载，但未经作者同意必须保留此段声明，且在文章页面明显位置给出原文连接，否则保留追究法律责任的权利。</p>
</blockquote>

      
    </div>

    
    
    
      <footer class="post-footer">
        <div class="post-eof"></div>
      </footer>
  </article>
  
  
  


  
  <nav class="pagination">
    <a class="extend prev" rel="prev" href="/jadepeng/"><i class="fa fa-angle-left" aria-label="上一页"></i></a><a class="page-number" href="/jadepeng/">1</a><span class="page-number current">2</span><a class="page-number" href="/jadepeng/page/3/">3</a><span class="space">&hellip;</span><a class="page-number" href="/jadepeng/page/10/">10</a><a class="extend next" rel="next" href="/jadepeng/page/3/"><i class="fa fa-angle-right" aria-label="下一页"></i></a>
  </nav>



          </div>
          

<script>
  window.addEventListener('tabs:register', () => {
    let { activeClass } = CONFIG.comments;
    if (CONFIG.comments.storage) {
      activeClass = localStorage.getItem('comments_active') || activeClass;
    }
    if (activeClass) {
      let activeTab = document.querySelector(`a[href="#comment-${activeClass}"]`);
      if (activeTab) {
        activeTab.click();
      }
    }
  });
  if (CONFIG.comments.storage) {
    window.addEventListener('tabs:click', event => {
      if (!event.target.matches('.tabs-comment .tab-content .tab-pane')) return;
      let commentClass = event.target.classList[1];
      localStorage.setItem('comments_active', commentClass);
    });
  }
</script>

        </div>
          
  
  <div class="toggle sidebar-toggle">
    <span class="toggle-line toggle-line-first"></span>
    <span class="toggle-line toggle-line-middle"></span>
    <span class="toggle-line toggle-line-last"></span>
  </div>

  <aside class="sidebar">
    <div class="sidebar-inner">

      <ul class="sidebar-nav motion-element">
        <li class="sidebar-nav-toc">
          文章目录
        </li>
        <li class="sidebar-nav-overview">
          站点概览
        </li>
      </ul>

      <!--noindex-->
      <div class="post-toc-wrap sidebar-panel">
      </div>
      <!--/noindex-->

      <div class="site-overview-wrap sidebar-panel">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <img class="site-author-image" itemprop="image" alt="JadePeng"
      src="/jadepeng/images/avatar.gif">
  <p class="site-author-name" itemprop="name">JadePeng</p>
  <div class="site-description" itemprop="description">JadePeng的技术笔记本</div>
</div>
<div class="site-state-wrap motion-element">
  <nav class="site-state">
      <div class="site-state-item site-state-posts">
          <a href="/jadepeng/archives/">
        
          <span class="site-state-item-count">98</span>
          <span class="site-state-item-name">日志</span>
        </a>
      </div>
      <div class="site-state-item site-state-categories">
            <a href="/jadepeng/categories/">
        <span class="site-state-item-count">2</span>
        <span class="site-state-item-name">分类</span></a>
      </div>
      <div class="site-state-item site-state-tags">
            <a href="/jadepeng/tags/">
          
        <span class="site-state-item-count">83</span>
        <span class="site-state-item-name">标签</span></a>
      </div>
  </nav>
</div>



      </div>
        <div class="back-to-top motion-element">
          <i class="fa fa-arrow-up"></i>
          <span>0%</span>
        </div>

    </div>
  </aside>
  <div id="sidebar-dimmer"></div>


      </div>
    </main>

    <footer class="footer">
      <div class="footer-inner">
        

        

<div class="copyright">
  
  &copy; 
  <span itemprop="copyrightYear">2021</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">JadePeng</span>
    <span class="post-meta-divider">|</span>
    <span class="post-meta-item-icon">
      <i class="fa fa-chart-area"></i>
    </span>
      <span class="post-meta-item-text">站点总字数：</span>
    <span title="站点总字数">668k</span>
    <span class="post-meta-divider">|</span>
    <span class="post-meta-item-icon">
      <i class="fa fa-coffee"></i>
    </span>
      <span class="post-meta-item-text">站点阅读时长 &asymp;</span>
    <span title="站点阅读时长">10:08</span>
</div>
  <div class="powered-by">由 <a href="https://hexo.io/" class="theme-link" rel="noopener" target="_blank">Hexo</a> & <a href="https://mist.theme-next.org/" class="theme-link" rel="noopener" target="_blank">NexT.Mist</a> 强力驱动
  </div>

        
<div class="busuanzi-count">
  <script async src="https://busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
    <span class="post-meta-item" id="busuanzi_container_site_uv">
      <span class="post-meta-item-icon">
        <i class="fa fa-user"></i>
      </span>
      <span class="site-uv" title="总访客量">
        <span id="busuanzi_value_site_uv"></span>
      </span>
    </span>
    <span class="post-meta-divider">|</span>
    <span class="post-meta-item" id="busuanzi_container_site_pv">
      <span class="post-meta-item-icon">
        <i class="fa fa-eye"></i>
      </span>
      <span class="site-pv" title="总访问量">
        <span id="busuanzi_value_site_pv"></span>
      </span>
    </span>
</div>








      </div>
    </footer>
  </div>

  
  <script src="/jadepeng/lib/anime.min.js"></script>
  <script src="/jadepeng/lib/velocity/velocity.min.js"></script>
  <script src="/jadepeng/lib/velocity/velocity.ui.min.js"></script>

<script src="/jadepeng/js/utils.js"></script>

<script src="/jadepeng/js/motion.js"></script>


<script src="/jadepeng/js/schemes/muse.js"></script>


<script src="/jadepeng/js/next-boot.js"></script>




  




  
<script src="/jadepeng/js/local-search.js"></script>









<script>
document.querySelectorAll('.pdfobject-container').forEach(element => {
  let url = element.dataset.target;
  let pdfOpenParams = {
    navpanes : 0,
    toolbar  : 0,
    statusbar: 0,
    pagemode : 'thumbs',
    view     : 'FitH'
  };
  let pdfOpenFragment = '#' + Object.entries(pdfOpenParams).map(([key, value]) => `${key}=${encodeURIComponent(value)}`).join('&');
  let fullURL = `/jadepeng/lib/pdf/web/viewer.html?file=${encodeURIComponent(url)}${pdfOpenFragment}`;

  if (NexT.utils.supportsPDFs()) {
    element.innerHTML = `<embed class="pdfobject" src="${url + pdfOpenFragment}" type="application/pdf" style="height: ${element.dataset.height};">`;
  } else {
    element.innerHTML = `<iframe src="${fullURL}" style="height: ${element.dataset.height};" frameborder="0"></iframe>`;
  }
});
</script>


<script>
if (document.querySelectorAll('pre.mermaid').length) {
  NexT.utils.getScript('//cdn.jsdelivr.net/npm/mermaid@8/dist/mermaid.min.js', () => {
    mermaid.initialize({
      theme    : 'forest',
      logLevel : 3,
      flowchart: { curve     : 'linear' },
      gantt    : { axisFormat: '%m/%d/%Y' },
      sequence : { actorMargin: 50 }
    });
  }, window.mermaid);
}
</script>


  

  

</body>
</html>
